#language: ru
@tree

@UH33_Purchases

Функционал: 04. Под профилем "Корпоративные закупки"

	Как бизнес-аналитик я хочу
	проверить создание документов подситемы и закрытие регистров
	чтобы исключить ошибки

Контекст:

	И я подключаю TestClient "УХ - Закупки" логин "МенеджерПоЗакупкам1" пароль ""
	И я закрыл все окна клиентского приложения

Сценарий: 04.00. Ограниченные права: инициализация

	//И я закрываю TestClient "УХ - Закупки"

	И Я запоминаю значение выражения 'ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() И НЕ ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ()' в переменную "$$ЭтоУХ$$"
	И Я запоминаю значение выражения 'ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() И ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ()' в переменную "$$ЭтоЕРПУХ$$"
	И Я запоминаю значение выражения 'ИдентификацияПродуктаУХКлиентСервер.ВерсияУправлениеХолдингом()' в переменную "$$ВерсияУХ$$"
	И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "$$ТекущаяДата$$"	
	
Сценарий: 04.01. [ЗАПРОС КОТИРОВОК] СПЗ 1

	* Запоминаем ТекущаяДата, НачалоГода, КонецГода
		
		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
		И Я запоминаю значение выражения 'СокрЛП(НачалоГода(ТекущаяДата()))' в переменную "НачалоГода"
		И Я запоминаю значение выражения 'СокрЛП(КонецГода(ТекущаяДата()+365*24*60*60))' в переменную "КонецГода"

	* Открываем список СПЗ
	
		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
		Тогда открылось окно 'Строки планов закупок'
	
	* Создаем СПЗ
	
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Строка плана закупок (создание)'
		
	* Период закупок
	
		И я нажимаю кнопку выбора у поля с именем "ПериодЗакупок"
		Тогда открылось окно 'Периоды'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование' |
			| '2025 г.'      |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Строка плана закупок (создание)'
	
	* Способ выбора	
	
		И я нажимаю кнопку выбора у поля с именем "СпособВыбораПоставщика"
		И из выпадающего списка с именем "СпособВыбораПоставщика" я выбираю точное значение 'Запрос котировок'

	* Заказчик	
	
		И я нажимаю кнопку выбора у поля с именем "ОрганизацияДляЗаключенияДоговора"
		Тогда открылось окно 'Организационные единицы'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование в программе' |
			| 'Королевство Севера [223]' |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Строка плана закупок (создание) *'
	
	* ОрганизаторЗакупки	
	
		И я нажимаю кнопку выбора у поля с именем "ОрганизаторЗакупки"
		Тогда открылось окно 'Организационные единицы'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование в программе' |
			| 'Семь королевств'          |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Строка плана закупок (создание) *'
	
	* Вариант оплаты	
	
		И я нажимаю кнопку выбора у поля с именем "ВариантОплаты"
		Тогда открылось окно 'Условия оплаты'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование'                                       |
			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Строка плана закупок (создание) *'
		
	* Валюта закупок	
		
		И из выпадающего списка с именем "ВалютаДокумента" я выбираю точное значение 'RUB'
		
	* Предмет договора	
		
		И я нажимаю кнопку выбора у поля с именем "ПредметДоговора"
		Тогда открылось окно 'Предмет договора'
		И в поле с именем 'InputFld' я ввожу текст 'Приобретение материалов, тест 1'
		И я нажимаю на кнопку с именем 'OK'
		Тогда открылось окно 'Строка плана закупок (создание) *'
	
	* Общие требования
	
		И я перехожу к следующему реквизиту
		И я нажимаю кнопку выбора у поля с именем "ОбщиеТребования"
		Тогда открылось окно 'Общие требования'
		И в поле с именем 'InputFld' я ввожу текст 'Нет, тест 1'
		И я нажимаю на кнопку с именем 'OK'
		Тогда открылось окно 'Строка плана закупок (создание) *'
		
	* Даты 
	
		И в поле с именем 'ДатаНачалаПодготовкиЗакупки' я ввожу значение переменной "НачалоГода"
		И я перехожу к следующему реквизиту
		И в поле с именем 'ДатаОфициальногоОбъявленияЗакупки' я ввожу значение переменной "ТекущаяДата"
		И я перехожу к следующему реквизиту
		И в поле с именем 'ДатаИсполненияДоговора' я ввожу значение переменной "КонецГода"
		И я перехожу к следующему реквизиту
		
	* Закладка ЕИС
	
		И я перехожу к закладке с именем "ГруппаЕИС"
		И в поле с именем 'ПорядокФормированияЦеныДоговора' я ввожу текст 'Цена включает НДС'
	
	* Закладка Потребности
	
		И я перехожу к закладке с именем "ГруппаПотребности"
		И в таблице 'Номенклатура' я нажимаю на кнопку с именем 'НоменклатураДобавить'

	* 2025

		* Матерал 1
		
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураНоменклатура'
			Тогда открылось окно "Выбор типа данных"
			И в таблице "TypeTree" я перехожу к строке:
				| 'Колонка1'           |
				| 'Номенклатура'       |
			И в таблице "TypeTree" я выбираю текущую строку
			
			И я нажимаю на кнопку с именем 'ФормаСписок'
			
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" | "% НДС" | "Единица" |
				| "Материал1"    | "20%"   | "т"       |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Потребитель

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураЦФО'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураЦФО'
			Тогда открылось окно 'Организационные единицы'
			
			И я нажимаю на кнопку с именем 'ФормаСписок'
					
			И в таблице "Список" я перехожу к строке:
				| 'Наименование в программе' |
				| 'Королевство Севера [223]' |
			И в таблице "Список" я выбираю текущую строку
			
		* Место поставки
			
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураМестоПоставки'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураМестоПоставки'
			Тогда открылось окно "Места поставки товаров (оказания услуг)"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование"   |
				| "МестоПоставки1" |
			И в таблице 'Список' я выбираю текущую строку

		* Дата поставки

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураДатаПоставки'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' в поле с именем 'НоменклатураДатаПоставки' я ввожу текст "15.08.2025"
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Цена

			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' в поле с именем 'НоменклатураЦена' я ввожу текст "1 200,00"
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Количество

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураКоличество'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' в поле с именем 'НоменклатураКоличество' я ввожу текст "100,000"
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Проект

			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПроект'
			Тогда открылось окно "Проекты и этапы"
			И я нажимаю на кнопку с именем 'ФормаСписок'
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "Проект1"      |
			И в таблице 'Список' я выбираю текущую строку
			
		* Статья БДДС

			И в таблице 'Номенклатура' я активизирую поле с именем 'ПланыДокументаНоменклатураСтатьяБюджета'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'ПланыДокументаНоменклатураСтатьяБюджета'
			Тогда открылось окно "Статьи движения денежных средств"
			И я нажимаю на кнопку с именем 'ФормаСписок'
			И в таблице 'Список' я перехожу к строке:
				| "Наименование"  |
				| "Статья БДДС 1" |
			И в таблице 'Список' я выбираю текущую строку
	
		* Аналитика1

			И я перехожу к следующему реквизиту
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика1'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика1'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "AAA1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика2

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика2'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика2'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "BBB1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика3

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика3'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика3'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "CCC1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика4

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика4'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика4'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "DDD1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика5

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика5'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика5'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "EEE1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика6

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика6'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика6'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "FFF1"         |
			И в таблице 'Список' я выбираю текущую строку


		* Статья БДР

			И в таблице 'Номенклатура' я активизирую поле с именем 'ПланыДокументаНоменклатураСтатьяБюджетаБДР'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'ПланыДокументаНоменклатураСтатьяБюджетаБДР'
			Тогда открылось окно "Статьи доходов и расходов"
			И я нажимаю на кнопку с именем 'ФормаСписок'
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "Статья БДР 1" |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика1 

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР1'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР1'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "XXX1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика2 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР2'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР2'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "YYY1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика3 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР3'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР3'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "ZZZ1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика4 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР4'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР4'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "SSS1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика5 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР5'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР5'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "RRR1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика6 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР6'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР6'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "WWW1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

	* 2026

		И в таблице 'Номенклатура' я нажимаю на кнопку с именем 'НоменклатураДобавить'

		* Матерал 2
		
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураНоменклатура'
			Тогда открылось окно "Выбор типа данных"
			И в таблице "TypeTree" я перехожу к строке:
				| 'Колонка1'           |
				| 'Номенклатура'       |
			И в таблице "TypeTree" я выбираю текущую строку
			
			И я нажимаю на кнопку с именем 'ФормаСписок'
			
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" | "% НДС" | "Единица" |
				| "Материал2"    | "20%"   | "т"       |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Потребитель

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураЦФО'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураЦФО'
			Тогда открылось окно 'Организационные единицы'
			
			И я нажимаю на кнопку с именем 'ФормаСписок'
					
			И в таблице "Список" я перехожу к строке:
				| 'Наименование в программе' |
				| 'Королевство Севера [223]' |
			И в таблице "Список" я выбираю текущую строку
			
		* Место поставки
			
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураМестоПоставки'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураМестоПоставки'
			Тогда открылось окно "Места поставки товаров (оказания услуг)"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование"   |
				| "МестоПоставки1" |
			И в таблице 'Список' я выбираю текущую строку
		
		* Дата поставки

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураДатаПоставки'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' в поле с именем 'НоменклатураДатаПоставки' я ввожу текст "20.07.2026"
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Цена

			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' в поле с именем 'НоменклатураЦена' я ввожу текст "1 400,00"
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Количество

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураКоличество'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' в поле с именем 'НоменклатураКоличество' я ввожу текст "250,000"
			И в таблице "Номенклатура" я перехожу к следующей ячейке

		* Проект

			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПроект'
			Тогда открылось окно "Проекты и этапы"
			И я нажимаю на кнопку с именем 'ФормаСписок'
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "Проект1"      |
			И в таблице 'Список' я выбираю текущую строку
			
		* Статья БДДС

			И в таблице 'Номенклатура' я активизирую поле с именем 'ПланыДокументаНоменклатураСтатьяБюджета'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'ПланыДокументаНоменклатураСтатьяБюджета'
			Тогда открылось окно "Статьи движения денежных средств"
			И я нажимаю на кнопку с именем 'ФормаСписок'
			И в таблице 'Список' я перехожу к строке:
				| "Наименование"  |
				| "Статья БДДС 1" |
			И в таблице 'Список' я выбираю текущую строку
	
		* Аналитика1

			И я перехожу к следующему реквизиту
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика1'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика1'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "AAA1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика2

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика2'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика2'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "BBB1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика3

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика3'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика3'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "CCC1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика4

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика4'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика4'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "DDD1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика5

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика5'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика5'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "EEE1"         |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика6

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитика6'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитика6'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "FFF1"         |
			И в таблице 'Список' я выбираю текущую строку


		* Статья БДР

			И в таблице 'Номенклатура' я активизирую поле с именем 'ПланыДокументаНоменклатураСтатьяБюджетаБДР'
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'ПланыДокументаНоменклатураСтатьяБюджетаБДР'
			Тогда открылось окно "Статьи доходов и расходов"
			И я нажимаю на кнопку с именем 'ФормаСписок'
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "Статья БДР 1" |
			И в таблице 'Список' я выбираю текущую строку

		* Аналитика1 

			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР1'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР1'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "XXX1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика2 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР2'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР2'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "YYY1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика3 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР3'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР3'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "ZZZ1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика4 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР4'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР4'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "SSS1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика5 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР5'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР5'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "RRR1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

		* Аналитика6 

			И в таблице "Номенклатура" я перехожу к следующей ячейке
			И в таблице 'Номенклатура' я активизирую поле с именем 'НоменклатураПланыДокументаАналитикаБДР6'
			И в таблице 'Номенклатура' я выбираю текущую строку
			И в таблице 'Номенклатура' я нажимаю кнопку выбора у реквизита с именем 'НоменклатураПланыДокументаАналитикаБДР6'
			Тогда открылось окно "Произвольный классификатор"
			И в таблице 'Список' я перехожу к строке:
				| "Наименование" |
				| "WWW1"         |
			И в таблице 'Список' я выбираю текущую строку
			И в таблице 'Номенклатура' я завершаю редактирование строки

	* Финансирование
	
		И я перехожу к закладке с именем "ГруппаФинансирование"
		И в таблице "Финансирование" я нажимаю на кнопку с именем 'ФинансированиеЗаполнитьПериодыФинансирования'
		И в таблице "Финансирование" я нажимаю на кнопку с именем 'ФинансированиеРаспределитьСуммуФинансирования'

	* Пересчитаем сумму
	
		И я нажимаю на кнопку с именем 'ОбновитьИтогиВШапке'
	
	* Запись документа
	
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
		Тогда открылось окно 'Строка плана закупок * от *'
		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
		
		Если открылось окно '1С:Предприятие' Тогда
			И я нажимаю на кнопку с именем 'Button0'
		
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна 'Строка плана закупок * от *' в течение 20 секунд

Сценарий: 04.02. [ЗАПРОС ПРЕДЛОЖЕНИЙ] СПЗ 2
//
//	* Запоминаем ТекущаяДата, НачалоГода, КонецГода
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		И Я запоминаю значение выражения 'СокрЛП(НачалоГода(ТекущаяДата()))' в переменную "НачалоГода"
//		И Я запоминаю значение выражения 'СокрЛП(КонецГода(ТекущаяДата()))' в переменную "КонецГода"
//
//	* Открываем список СПЗ
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
//		Тогда открылось окно 'Строки планов закупок'
//	
//	* Создаем СПЗ
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Строка плана закупок (создание)'
//		
//	* Период закупок
//	
//		И я нажимаю кнопку выбора у поля с именем "ПериодЗакупок"
//		Тогда открылось окно 'Периоды'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| '2024 г.'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание)'
//	
//	* Способ выбора	
//	
//		И я нажимаю кнопку выбора у поля с именем "СпособВыбораПоставщика"
//		И из выпадающего списка с именем "СпособВыбораПоставщика" я выбираю точное значение 'Запрос предложений'
//		
//	* Заказчик	
//	
//		И я нажимаю кнопку выбора у поля с именем "ОрганизацияДляЗаключенияДоговора"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* ОрганизаторЗакупки	
//	
//		И я нажимаю кнопку выбора у поля с именем "ОрганизаторЗакупки"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Семь королевств'          |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* Вариант оплаты	
//	
//		И я нажимаю кнопку выбора у поля с именем "ВариантОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Валюта закупок	
//		
//		И из выпадающего списка с именем "ВалютаДокумента" я выбираю точное значение 'RUB'
//		
//	* Предмет договора	
//		
//		И я нажимаю кнопку выбора у поля с именем "ПредметДоговора"
//		Тогда открылось окно 'Предмет договора'
//		И в поле с именем 'InputFld' я ввожу текст 'Приобретение материалов, тест 2'
//		И я нажимаю на кнопку с именем 'OK'
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* Общие требования
//	
//		И я перехожу к следующему реквизиту
//		И я нажимаю кнопку выбора у поля с именем "ОбщиеТребования"
//		Тогда открылось окно 'Общие требования'
//		И в поле с именем 'InputFld' я ввожу текст 'Нет, тест 2'
//		И я нажимаю на кнопку с именем 'OK'
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Даты 
//	
//		И в поле с именем 'ДатаНачалаПодготовкиЗакупки' я ввожу значение переменной "НачалоГода"
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаОфициальногоОбъявленияЗакупки' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаИсполненияДоговора' я ввожу значение переменной "КонецГода"
//		И я перехожу к следующему реквизиту
//		
//	* Закладка ЕИС
//	
//		И я перехожу к закладке с именем "ГруппаЕИС"
//		И в поле с именем 'ПорядокФормированияЦеныДоговора' я ввожу текст 'Цена включает НДС'
//	
//	* Закладка Потребности
//	
//		И я перехожу к закладке с именем "ГруппаПотребности"
//
//	* Матерал 2
//
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "TypeTree" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Номенклатура'       |
//		И в таблице "TypeTree" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//	
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Материал2'    |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//
//	* Потребитель
//		
//		И я перехожу к следующему реквизиту
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Место поставки
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки1' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//	
//	* 2024
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодам2024Количество"
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейАвгустКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейАвгустКоличество' я ввожу текст '100,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//		И я перехожу к следующему реквизиту
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейСентябрьКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейСентябрьКоличество' я ввожу текст '100,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//
//	* Матерал 3
//
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "TypeTree" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Номенклатура'       |
//		И в таблице "TypeTree" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//	
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Материал3'    |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//
//	* Потребитель
//		
//		И я перехожу к следующему реквизиту
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Место поставки
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки1' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//	
//	* 2024
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодам2024Количество"
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейАвгустКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейАвгустКоличество' я ввожу текст '50,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//		И я перехожу к следующему реквизиту
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейСентябрьКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейСентябрьКоличество' я ввожу текст '50,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//
//	* Пересчитаем сумму
//	
//		И я нажимаю на кнопку с именем 'ОбновитьИтогиВШапке'
//
//	* ЦФО Исполнитель
//
//		И я нажимаю кнопку выбора у поля с именем "ЦФОИсполнитель"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе'      |
//			| 'ЦФО1 Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//	
//	* Запись документа
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Строка плана закупок * от *'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Строка плана закупок * от *' в течение 20 секунд
//
Сценарий: 04.03. [КОНКУРС] СПЗ 3
//
//	* Запоминаем ТекущаяДата, НачалоГода, КонецГода
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		И Я запоминаю значение выражения 'СокрЛП(НачалоГода(ТекущаяДата()))' в переменную "НачалоГода"
//		И Я запоминаю значение выражения 'СокрЛП(КонецГода(ТекущаяДата()))' в переменную "КонецГода"
//		
//	* Открываем список СПЗ
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
//		Тогда открылось окно 'Строки планов закупок'
//	
//	* Создаем СПЗ
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Строка плана закупок (создание)'
//		
//	* Период закупок
//	
//		И я нажимаю кнопку выбора у поля с именем "ПериодЗакупок"
//		Тогда открылось окно 'Периоды'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| '2024 г.'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание)'
//	
//	* Способ выбора	
//
//		И я нажимаю кнопку выбора у поля с именем "СпособВыбораПоставщика"
//		И из выпадающего списка с именем "СпособВыбораПоставщика" я выбираю точное значение 'Конкурс'		
//
//	* Заказчик	
//	
//		И я нажимаю кнопку выбора у поля с именем "ОрганизацияДляЗаключенияДоговора"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* ОрганизаторЗакупки	
//	
//		И я нажимаю кнопку выбора у поля с именем "ОрганизаторЗакупки"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Семь королевств'          |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* Вариант оплаты	
//	
//		И я нажимаю кнопку выбора у поля с именем "ВариантОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Валюта закупок	
//		
//		И из выпадающего списка с именем "ВалютаДокумента" я выбираю точное значение 'RUB'
//		
//	* Предмет договора	
//		
//		И я нажимаю кнопку выбора у поля с именем "ПредметДоговора"
//		Тогда открылось окно 'Предмет договора'
//		И в поле с именем 'InputFld' я ввожу текст 'Приобретение материалов, тест 3'
//		И я нажимаю на кнопку с именем 'OK'
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* Общие требования
//	
//		И я перехожу к следующему реквизиту
//		И я нажимаю кнопку выбора у поля с именем "ОбщиеТребования"
//		Тогда открылось окно 'Общие требования'
//		И в поле с именем 'InputFld' я ввожу текст 'Нет, тест 3'
//		И я нажимаю на кнопку с именем 'OK'
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Даты 
//	
//		И в поле с именем 'ДатаНачалаПодготовкиЗакупки' я ввожу значение переменной "НачалоГода"
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаОфициальногоОбъявленияЗакупки' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаИсполненияДоговора' я ввожу значение переменной "КонецГода"
//		И я перехожу к следующему реквизиту
//		
//	* Закладка ЕИС
//	
//		И я перехожу к закладке с именем "ГруппаЕИС"
//		И в поле с именем 'ПорядокФормированияЦеныДоговора' я ввожу текст 'Цена включает НДС'
//	
//	* Закладка Потребности
//	
//		И я перехожу к закладке с именем "ГруппаПотребности"
//		
//
//	* Товар 1
//
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "TypeTree" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Номенклатура'       |
//		И в таблице "TypeTree" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//	
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Товар1'       |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//
//	* Потребитель
//		
//		И я перехожу к следующему реквизиту
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Место поставки
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки1' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//	
//	* 2024
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодам2024Количество"
//		И пауза 1
//		
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейАвгустКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейАвгустКоличество' я ввожу текст '555,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//
//	* Товар 2
//
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "TypeTree" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Номенклатура'       |
//		И в таблице "TypeTree" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//	
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Товар2'    |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//
//	* Потребитель
//		
//		И я перехожу к следующему реквизиту
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Место поставки
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки2' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//	
//	* 2024
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодам2024Количество"
//		И пауза 1
//		
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейАвгустКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейАвгустКоличество' я ввожу текст '777,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//		
//	* Пересчитаем сумму
//	
//		И я нажимаю на кнопку с именем 'ОбновитьИтогиВШапке'
//	
//	* ЦФО Исполнитель
//
//		И я нажимаю кнопку выбора у поля с именем "ЦФОИсполнитель"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе'      |
//			| 'ЦФО1 Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//	
//	* Запись документа
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Строка плана закупок * от *'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//		
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Строка плана закупок * от *' в течение 20 секунд
//		И я закрываю окно 'Строки планов закупок'
//
Сценарий: 04.04. [ЗАПРОС КОТИРОВОК] Закупочная процедура 1 / лотовая
//
//	* Создаем процедуру
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
//		Тогда открылось окно 'Строки планов закупок'
//		И в таблице "Список" я перехожу к строке:
//			|'Период закупок'| 'Заказчик'                 | 'Организатор'     | 'Способ закупки'   | 'Предмет договора'                | 'Состояние' | 'Сумма'      |'Валюта' | 'Статус'    |
//			|'2024 г.'       | 'Королевство Севера [223]' | 'Семь королевств' | 'Запрос котировок' | 'Приобретение материалов, тест 1' | 'Утвержден' | '250 000,00' |  'RUB'  | 'Утвержден' |
//	
//		И я нажимаю на кнопку с именем 'ФормаСправочникЗакупочныеПроцедурыПолучитьСоздатьЗакупочнуюПроцедуру'
//		Тогда открылось окно 'Закупочная процедура №*'
//	
//	* Приказ о назначении закупочной комиссии
//	
//		И я нажимаю кнопку выбора у поля с именем "ПриказОНазначенииЗакупочнойКомиссии"
//		Тогда открылось окно 'Приказы закупочной комиссии'
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер приказа' |
//			| '000000001'     |
//		И в таблице "Список" я выбираю текущую строку
//	
//	* Расписание процедуры
//	
//		И я нажимаю на гиперссылку с именем "СвязанноеМероприятие"
//		Тогда открылось окно 'Стадии закупочной процедуры'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Стадии закупочной процедуры' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//
//	* Лот 
//	
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		И в таблице "Лоты" я перехожу к первой строке
//		И в таблице "Лоты" я выбираю текущую строку
//		Тогда открылось окно 'Лоты * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Лоты * от *' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Условия
//	
//		И я перехожу к закладке с именем "ГруппаУсловияЗакупки"
//		
//		И в поле с именем 'ПояснениеУсловияПоставки' я ввожу текст 'Пояснение условий'
//		И в поле с именем 'ОписаниеГрафикаПоставки' я ввожу текст 'Описание графика'
//		И в поле с именем 'ПорядокПредоставления' я ввожу текст 'Порядок предоставления докментации'
//		И из выпадающего списка с именем "УсловияПоставкиИнкотермс" я выбираю точное значение 'FAS'
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		
//		#1С:Предприятие
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//		
//		Тогда открылось окно 'Закупочная процедура №*'
//
//	* Источник финансирования
//	
//		И я нажимаю кнопку выбора у поля с именем "ИсточникФинансирования"
//		Тогда открылось окно 'Источники финансирования'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'               |
//			| 'Собственное финансирование' |
//		И в таблице "Список" я выбираю текущую строку
//		
//	* Записываем документ	
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//
//	* Закладка лоты
//	
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		И в таблице "Лоты" я перехожу к строке:
//			| 'Период закупок' | 'Вид закупки'     | 'Заказчик'                 | 'Метод оценки' | 'Предмет договора'                | 'НМЦ'             |
//			| '2024 г.'        | 'Лотовая закупка' | 'Королевство Севера [223]' | 'По ценам'     | 'Приобретение материалов, тест 1' | '950 000,00, RUB' |
//	
//	* Предложение участника 1
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДокументПредложениеПоставщикаСоздатьНаОсновании'
//		Тогда открылось окно 'Предложение участника (создание)'
//		
//		И я нажимаю кнопку выбора у поля с именем "КонтрагентБезОтбора"
//		Тогда открылось окно 'Контрагенты'
//		
//		И я нажимаю на кнопку с именем 'ФормаДерево'
//		
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик1'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтраницаУсловия"
//		
//		И в поле с именем 'УсловияПоставки' я ввожу текст 'Условия 1'
//		И в поле с именем 'СрокиВыполненияДоговора' я ввожу текст 'Сроки выполнения 1'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'СрокПоставки' я ввожу текст '3'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтаницаНоменклатура"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '850,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Предложение участника (создание) *' в течение 20 секунд
//
//	* Предложение участника 2
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДокументПредложениеПоставщикаСоздатьНаОсновании'
//		Тогда открылось окно 'Предложение участника (создание)'
//		
//		И я нажимаю кнопку выбора у поля с именем "КонтрагентБезОтбора"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик2'               |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Тогда открылось окно 'Предложение участника (создание) *'
//		И я перехожу к закладке с именем "ГруппаСтраницаУсловия"
//		И в поле с именем 'УсловияПоставки' я ввожу текст 'Условия 2'
//		И в поле с именем 'СрокиВыполненияДоговора' я ввожу текст 'Сроки выполнения 2'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'СрокПоставки' я ввожу текст '2'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//
//		Если открылось окно '1С:Предприятие'
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтаницаНоменклатура"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '600,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Предложение участника (создание) *' в течение 20 секунд
//		
//		И Я закрываю окно 'Закупочная процедура №*'
//		И я закрываю окно 'Строки планов закупок'
//
Сценарий: 04.05. [ЗАПРОС ПРЕДЛОЖЕНИЙ] Закупочная процедура 2 / попозиционная
//
//	* Создаем процедуру
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
//		Тогда открылось окно 'Строки планов закупок'
//		И в таблице "Список" я перехожу к строке:
//			| 'Валюта' | 'Заказчик'                 | 'Организатор'     |'Период закупок' | 'Предмет договора'                | 'Состояние' | 'Способ закупки'     | 'Статус'    | 'Сумма'      |
//			| 'RUB'    | 'Королевство Севера [223]' | 'Семь королевств' |'2024 г.'        | 'Приобретение материалов, тест 2' | 'Утвержден' | 'Запрос предложений' | 'Утвержден' | '410 000,00' |
//	
//		И я нажимаю на кнопку с именем 'ФормаСправочникЗакупочныеПроцедурыПолучитьСоздатьЗакупочнуюПроцедуру'
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Приказ о назначении закупочной комиссии
//	
//		И я нажимаю кнопку выбора у поля с именем "ПриказОНазначенииЗакупочнойКомиссии"
//		Тогда открылось окно 'Приказы закупочной комиссии'
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер приказа' |
//			| '000000001'     |
//		И в таблице "Список" я выбираю текущую строку
//	
//	* Расписание процедуры
//	
//		И я нажимаю на гиперссылку с именем "СвязанноеМероприятие"
//		Тогда открылось окно 'Стадии закупочной процедуры'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Стадии закупочной процедуры' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Лот 
//	
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		И в таблице "Лоты" я перехожу к первой строке
//		И в таблице "Лоты" я выбираю текущую строку
//		Тогда открылось окно 'Лоты * от *'
//		
//		И из выпадающего списка с именем "ВидЗакупкиОсновнаяВкладка" я выбираю точное значение 'Попозиционная закупка'
//		И из выпадающего списка с именем "МетодОценкиПредложенийПоставщиков" я выбираю точное значение 'По ценам'
//
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Лоты * от *' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Условия
//	
//		И я перехожу к закладке с именем "ГруппаУсловияЗакупки"
//		
//		И в поле с именем 'ПояснениеУсловияПоставки' я ввожу текст 'Пояснение условий'
//		И в поле с именем 'ОписаниеГрафикаПоставки' я ввожу текст 'Описание графика'
//		И в поле с именем 'ПорядокПредоставления' я ввожу текст 'Порядок предоставления докментации'
//		И из выпадающего списка с именем "УсловияПоставкиИнкотермс" я выбираю точное значение 'FAS'
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Закупочная процедура №*'
//
//	* Источник финансирования
//	
//		И я нажимаю кнопку выбора у поля с именем "ИсточникФинансирования"
//		Тогда открылось окно 'Источники финансирования'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'               |
//			| 'Собственное финансирование' |
//		И в таблице "Список" я выбираю текущую строку
//		
//	* Записываем документ	
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//	* Закладка лоты
//
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		И Пауза 5
//		И в таблице "Лоты" я перехожу к строке:
//			| 'Период закупок' | 'Вид закупки'           | 'Заказчик'                 | 'Метод оценки' | 'Предмет договора'                | 'НМЦ'             |
//			| '2024 г.'        | 'Попозиционная закупка' | 'Королевство Севера [223]' | 'По ценам'     | 'Приобретение материалов, тест 2' | '410 000,00, RUB' |
//	
//	* Предложение участника 1
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДокументПредложениеПоставщикаСоздатьНаОсновании'
//		Тогда открылось окно 'Предложение участника (создание)'
//		
//		И я нажимаю кнопку выбора у поля с именем "КонтрагентБезОтбора"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик3'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтраницаУсловия"
//		
//		И в поле с именем 'УсловияПоставки' я ввожу текст 'Условия 1'
//		И в поле с именем 'СрокиВыполненияДоговора' я ввожу текст 'Сроки выполнения 1'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'СрокПоставки' я ввожу текст '3'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтаницаНоменклатура"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '1 250,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я перехожу к строке:
//			| 'Место поставки' | 'Номенклатура' | 'Сумма с НДС' | 'Товар не поставляется' |
//			| 'МестоПоставки1' | 'Материал3'    | '150 000,00'  | 'Нет'                   |
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамТоварНеПоставляется"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я устанавливаю флаг с именем 'УсловияПоНоменклатуреПоПериодамТоварНеПоставляется'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//			
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Предложение участника (создание) *' в течение 20 секунд
//
//	* Предложение участника 2
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДокументПредложениеПоставщикаСоздатьНаОсновании'
//		Тогда открылось окно 'Предложение участника (создание)'
//		
//		И я нажимаю кнопку выбора у поля с именем "КонтрагентБезОтбора"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик4'               |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Тогда открылось окно 'Предложение участника (создание) *'
//		И я перехожу к закладке с именем "ГруппаСтраницаУсловия"
//		И в поле с именем 'УсловияПоставки' я ввожу текст 'Условия 2'
//		И в поле с именем 'СрокиВыполненияДоговора' я ввожу текст 'Сроки выполнения 2'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'СрокПоставки' я ввожу текст '2'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтаницаНоменклатура"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '1 200,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я перехожу к строке:
//			| 'Место поставки' | 'Номенклатура' | 'Сумма с НДС' | 'Товар не поставляется' |
//			| 'МестоПоставки1' | 'Материал3'    | '150 000,00'  | 'Нет'                   |
//		
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '1 100,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Предложение участника (создание) *' в течение 20 секунд
//		
//		И Я закрываю окно 'Закупочная процедура №*'
//		И я закрываю окно 'Строки планов закупок'
//	
Сценарий: 04.06. [КОНКУРС] Закупочная процедура 3 / зонтичная
//
//	* Создаем процедуру
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
//		Тогда открылось окно 'Строки планов закупок'
//		И в таблице "Список" я перехожу к строке:
//			| 'Валюта' | 'Заказчик'                 | 'Организатор'     |'Период закупок' | 'Предмет договора'                | 'Состояние' | 'Способ закупки' | 'Статус'    | 'Сумма'         |
//			| 'RUB'    | 'Королевство Севера [223]' | 'Семь королевств' |'2024 г.'        | 'Приобретение материалов, тест 3' | 'Утвержден' | 'Конкурс'        | 'Утвержден' | '12 154 500,00' |
//	
//		И я нажимаю на кнопку с именем 'ФормаСправочникЗакупочныеПроцедурыПолучитьСоздатьЗакупочнуюПроцедуру'
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Приказ о назначении закупочной комиссии
//	
//		И я нажимаю кнопку выбора у поля с именем "ПриказОНазначенииЗакупочнойКомиссии"
//		Тогда открылось окно 'Приказы закупочной комиссии'
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер приказа' |
//			| '000000001'     |
//		И в таблице "Список" я выбираю текущую строку
//	
//	* Расписание процедуры
//	
//		И я нажимаю на гиперссылку с именем "СвязанноеМероприятие"
//		Тогда открылось окно 'Стадии закупочной процедуры'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Стадии закупочной процедуры' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Лот 
//	
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		И в таблице "Лоты" я перехожу к первой строке
//		И в таблице "Лоты" я выбираю текущую строку
//		Тогда открылось окно 'Лоты * от *'
//		
//		И из выпадающего списка с именем "ВидЗакупкиОсновнаяВкладка" я выбираю точное значение 'Зонтичная закупка'
//		И из выпадающего списка с именем "МетодОценкиПредложенийПоставщиков" я выбираю точное значение 'По ценам'
//
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Лоты * от *' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Условия
//	
//		И я перехожу к закладке с именем "ГруппаУсловияЗакупки"
//		
//		И в поле с именем 'ПояснениеУсловияПоставки' я ввожу текст 'Пояснение условий'
//		И в поле с именем 'ОписаниеГрафикаПоставки' я ввожу текст 'Описание графика'
//		И в поле с именем 'ПорядокПредоставления' я ввожу текст 'Порядок предоставления докментации'
//		И из выпадающего списка с именем "УсловияПоставкиИнкотермс" я выбираю точное значение 'FAS'
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//			
//		Тогда открылось окно 'Закупочная процедура №*'
//
//	* Источник финансирования
//	
//		И я нажимаю кнопку выбора у поля с именем "ИсточникФинансирования"
//		Тогда открылось окно 'Источники финансирования'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'               |
//			| 'Собственное финансирование' |
//		И в таблице "Список" я выбираю текущую строку
//		
//	* Записываем документ	
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//
//	* Закладка лоты
//	
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		И в таблице "Лоты" я перехожу к строке:
//			| 'Период закупок' | 'Вид закупки'       | 'Заказчик'                 | 'Метод оценки' | 'Предмет договора'                | 'НМЦ'                |
//			| '2024 г.'        | 'Зонтичная закупка' | 'Королевство Севера [223]' | 'По ценам'     | 'Приобретение материалов, тест 3' | '12 154 500,00, RUB' |
//	
//	* Предложение участника 1
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДокументПредложениеПоставщикаСоздатьНаОсновании'
//		Тогда открылось окно 'Предложение участника (создание)'
//		
//		И я нажимаю кнопку выбора у поля с именем "КонтрагентБезОтбора"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик4'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтраницаУсловия"
//		
//		И в поле с именем 'УсловияПоставки' я ввожу текст 'Условия 1'
//		И в поле с именем 'СрокиВыполненияДоговора' я ввожу текст 'Сроки выполнения 1'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'СрокПоставки' я ввожу текст '3'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтаницаНоменклатура"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '1 250,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Предложение участника (создание) *' в течение 20 секунд
//
//	* Предложение участника 2
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДокументПредложениеПоставщикаСоздатьНаОсновании'
//		Тогда открылось окно 'Предложение участника (создание)'
//		
//		И я нажимаю кнопку выбора у поля с именем "КонтрагентБезОтбора"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик5'               |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Тогда открылось окно 'Предложение участника (создание) *'
//		И я перехожу к закладке с именем "ГруппаСтраницаУсловия"
//		И в поле с именем 'УсловияПоставки' я ввожу текст 'Условия 2'
//		И в поле с именем 'СрокиВыполненияДоговора' я ввожу текст 'Сроки выполнения 2'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'СрокПоставки' я ввожу текст '2'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		Тогда открылось окно 'Предложение участника (создание) *'
//		
//		И я перехожу к закладке с именем "ГруппаСтаницаНоменклатура"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я активизирую поле с именем "УсловияПоНоменклатуреПоПериодамЦена"
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я выбираю текущую строку
//		И в таблице "УсловияПоНоменклатуреПоПериодам" в поле с именем 'УсловияПоНоменклатуреПоПериодамЦена' я ввожу текст '1 200,00'
//		И в таблице "УсловияПоНоменклатуреПоПериодам" я завершаю редактирование строки
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Предложение участника (создание) *' в течение 20 секунд
//		
//		И Я закрываю окно 'Закупочная процедура №*'
//		И я закрываю окно 'Строки планов закупок'
//
Сценарий: 04.07. [ЗАПРОС КОТИРОВОК] Протокол и договор ДД1 по закупочной процедуре 1
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"	
//		
//	* Открываем закупочную процедуру
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Закупочные процедуры'
//		Тогда открылось окно 'Закупочные процедуры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Организатор закупки' | 'Период закупок' | 'Предмет договора'                | 'Способ закупки'   |
//			| 'Семь королевств'     | '2024 г.'        | 'Приобретение материалов, тест 1' | 'Запрос котировок' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//	
//	* 	Создаем протокол из процедуры
//	
//		И я нажимаю на кнопку с именем 'ДокументПротоколВыбораПобедителейСоздатьПротоколВыбораПобедителей'
//		Тогда открылось окно 'Протокол выбора победителей (создание)'
//		
//	* 	Дата протокола
//	
//		И в поле с именем 'ДатаПодписания' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* Переход к странице выбора победителя
//	
//		И я перехожу к закладке с именем "СтраницаДокументыВыбораПоЛотам"
//		
//	* Записываем протокол
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		
//	* Выбираем победителя
//	
//		И в таблице "ПредложенияПобедителей" я нажимаю на кнопку с именем 'НазначитьПоставщиковНоменклатуреЛота'
//		Тогда открылось окно 'Рассмотрение предложений участников'
//		И в таблице "НоменклатураПоПоставщикам" я нажимаю на кнопку с именем 'НоменклатураПоПоставщикамВыбратьПоПредложениюСМинимальнойОбщейСуммой'
//		И в таблице "НоменклатураПоПоставщикам" я нажимаю на кнопку с именем 'ФормаЗаписатьИзменения'
//		Тогда открылось окно 'Протокол выбора победителей * от * *'
//		
//	* 	Результаты работы комиссии
//		
//		И Пауза 1
//		И в поле с именем 'РезультатРаботыКомиссии' я ввожу текст 'Процедура состоялась, кворум имеется'
//		И я перехожу к следующему реквизиту
//		
//	* Место проведения процедуры
//	
//		И Пауза 1
//		И в поле с именем 'МестоПроведенияПроцедуры' я ввожу текст 'Место проведения'
//		И я перехожу к следующему реквизиту	
//		
//	* Еще раз записываем и проводим 
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//		
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//	* Создаем договор с поставщиком
//
//		И я нажимаю на кнопку с именем 'ФормаОбработкаФормированиеДоговоровСПобедителямиТорговУправлениеДоговорамиЗакупки'
//		Тогда открылось окно 'Формирование договоров с победителями торгов'
//		И в таблице "ПобедившиеПредложенияПоставщиков" я активизирую поле с именем "ПобедившиеПредложенияПоставщиковПоставщик"
//		И в таблице "ПобедившиеПредложенияПоставщиков" я нажимаю на кнопку с именем 'СоздатьДоговорПоВыбранномуПредложениюПоставщика'
//		Тогда открылось окно 'С поставщиком (создание)'
//	
//		И пауза 1
//	
//	* Дозаполняем договор	
//		
//		И в поле с именем 'Номер' я ввожу текст 'ДД1'
//		И я перехожу к следующему реквизиту
//		И я нажимаю кнопку выбора у поля с именем "Дата"
//		И в поле с именем 'Дата' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		И я перехожу к закладке с именем "ГруппаРасчеты"
//		И я перехожу к закладке с именем "СтраницаАналитикиПланирования"
//		И я перехожу к закладке с именем "СтраницаПланЗакупок"
//		И я перехожу к закладке с именем "ГруппаГрафик"
//		И в таблице "ГрафикРасчетов" я нажимаю на кнопку с именем 'ГрафикРассчитатьПоГрафикуПоставок'
//		
//	* Записываем и проводим договор
//
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'ДД1 от * (С поставщиком) вер. * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'ДД1 от * (С поставщиком) вер. * от *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения
//
Сценарий: 04.08. [ЗАПРОС ПРЕДЛОЖЕНИЙ] Протокол и договор ДД2 по закупочной процедуре 2
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"	
//		
//	* Открываем закупочную процедуру
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Закупочные процедуры'
//		Тогда открылось окно 'Закупочные процедуры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Организатор закупки' | 'Период закупок' | 'Предмет договора'                | 'Способ закупки'     |
//			| 'Семь королевств'     | '2024 г.'        | 'Приобретение материалов, тест 2' | 'Запрос предложений' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//	
//	* 	Создаем протокол из процедуры
//	
//		И я нажимаю на кнопку с именем 'ДокументПротоколВыбораПобедителейСоздатьПротоколВыбораПобедителей'
//		Тогда открылось окно 'Протокол выбора победителей (создание)'
//		
//	* 	Дата протокола
//	
//		И в поле с именем 'ДатаПодписания' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* Переход к странице выбора победителя
//	
//		И я перехожу к закладке с именем "СтраницаДокументыВыбораПоЛотам"
//		
//	* Записываем протокол
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		
//	* Выбираем победителя
//	
//		И в таблице "ПредложенияПобедителей" я нажимаю на кнопку с именем 'НазначитьПоставщиковНоменклатуреЛота'
//		Тогда открылось окно 'Рассмотрение предложений участников'
//		И в таблице "НоменклатураПоПоставщикам" я нажимаю на кнопку с именем 'НоменклатураПоПоставщикамВыбратьПоПредложениюСМинимальнойОбщейСуммой'
//		И в таблице "НоменклатураПоПоставщикам" я нажимаю на кнопку с именем 'ФормаЗаписатьИзменения'
//		Тогда открылось окно 'Протокол выбора победителей * от * *'
//		
//	* 	Результаты работы комиссии
//		
//		И Пауза 1
//		И в поле с именем 'РезультатРаботыКомиссии' я ввожу текст 'Процедура состоялась. Кворум имеется.'
//		И я перехожу к следующему реквизиту
//		
//	* Место проведения процедуры
//		
//		И Пауза 1
//		И в поле с именем 'МестоПроведенияПроцедуры' я ввожу текст 'Место проведения'
//		И я перехожу к следующему реквизиту
//	
//	* Еще раз записываем и проводим 
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//			
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//	* Создаем договор с поставщиком
//
//		И я нажимаю на кнопку с именем 'ФормаОбработкаФормированиеДоговоровСПобедителямиТорговУправлениеДоговорамиЗакупки'
//		Тогда открылось окно 'Формирование договоров с победителями торгов'
//		И в таблице "ПобедившиеПредложенияПоставщиков" я активизирую поле с именем "ПобедившиеПредложенияПоставщиковПоставщик"
//		И в таблице "ПобедившиеПредложенияПоставщиков" я нажимаю на кнопку с именем 'СоздатьДоговорПоВыбранномуПредложениюПоставщика'
//		Тогда открылось окно 'С поставщиком (создание)'
//		
//		И пауза 1
//	
//	* Дозаполняем договор	
//		
//		И в поле с именем 'Номер' я ввожу текст 'ДД2'
//		И я перехожу к следующему реквизиту
//		И я нажимаю кнопку выбора у поля с именем "Дата"
//		И в поле с именем 'Дата' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		И я перехожу к закладке с именем "ГруппаРасчеты"
//		И я перехожу к закладке с именем "СтраницаАналитикиПланирования"
//		И я перехожу к закладке с именем "СтраницаПланЗакупок"
//		И я перехожу к закладке с именем "ГруппаГрафик"
//		И в таблице "ГрафикРасчетов" я нажимаю на кнопку с именем 'ГрафикРассчитатьПоГрафикуПоставок'
//		
//	* Записываем и проводим договор
//
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'ДД2 от * (С поставщиком) вер. * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'ДД2 от * (С поставщиком) вер. * от *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения
//
Сценарий: 04.09. [КОНКУРС] Протокол и договор ДД3 по закупочной процедуре 3
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"	
//		
//	* Открываем закупочную процедуру
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Закупочные процедуры'
//		Тогда открылось окно 'Закупочные процедуры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Организатор закупки' | 'Период закупок' | 'Предмет договора'                | 'Способ закупки' |
//			| 'Семь королевств'     | '2024 г.'        | 'Приобретение материалов, тест 3' | 'Конкурс'        |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №0*'
//	
//	* 	Создаем протокол из процедуры
//	
//		И я нажимаю на кнопку с именем 'ДокументПротоколВыбораПобедителейСоздатьПротоколВыбораПобедителей'
//		Тогда открылось окно 'Протокол выбора победителей (создание)'
//		
//	* 	Дата протокола
//	
//		И в поле с именем 'ДатаПодписания' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* Переход к странице выбора победителя
//	
//		И я перехожу к закладке с именем "СтраницаДокументыВыбораПоЛотам"
//		
//	* Записываем протокол
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		
//	* Выбираем победителя
//	
//		И в таблице "ПредложенияПобедителей" я нажимаю на кнопку с именем 'РаспределениеПоЗонтичнойЗакупке'
//		
//	* 	Результаты работы комиссии
//		
//		И Пауза 1
//		И в поле с именем 'РезультатРаботыКомиссии' я ввожу текст 'Процедура состоялась. Кворум имеется.'
//		И я перехожу к следующему реквизиту
//		
//	* Место проведения процедуры
//	
//		И Пауза 1
//		И в поле с именем 'МестоПроведенияПроцедуры' я ввожу текст 'Место проведения'
//		И я перехожу к следующему реквизиту
//		
//	* Еще раз записываем и проводим
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//		
//		Если появилось предупреждение в течение 10 секунд тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//	* Открываем управление договорами
//
//		И я нажимаю на кнопку с именем 'ФормаОбработкаФормированиеДоговоровСПобедителямиТорговУправлениеДоговорамиЗакупки'
//		Тогда открылось окно 'Формирование договоров с победителями торгов'
//
//	* Создаем договор с Поставщиком4
//
//		И в таблице "ПобедившиеПредложенияПоставщиков" я перехожу к строке:
//			| 'Поставщик'  |
//			| 'Поставщик4' |
//		И в таблице "ПобедившиеПредложенияПоставщиков" я активизирую поле с именем "ПобедившиеПредложенияПоставщиковПоставщик"
//		И в таблице "ПобедившиеПредложенияПоставщиков" я нажимаю на кнопку с именем 'СоздатьДоговорПоВыбранномуПредложениюПоставщика'
//		Тогда открылось окно 'С поставщиком (создание)'
//		
//		И пауза 1
//		
//		И в поле с именем 'Номер' я ввожу текст 'ДД3-1'
//		И я перехожу к следующему реквизиту
//		
//		И я нажимаю кнопку выбора у поля с именем "Дата"
//		И в поле с именем 'Дата' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//		И я перехожу к закладке с именем "ГруппаРасчеты"
//		И я перехожу к закладке с именем "СтраницаАналитикиПланирования"
//		И я перехожу к закладке с именем "СтраницаПланЗакупок"
//		И я перехожу к закладке с именем "ГруппаГрафик"
//		И в таблице "ГрафикРасчетов" я нажимаю на кнопку с именем 'ГрафикРассчитатьПоГрафикуПоставок'
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'ДД3-1 от * (С поставщиком) вер. * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'ДД3-1 от * (С поставщиком) вер. * от *' в течение 20 секунд
//		Тогда открылось окно 'Формирование договоров с победителями торгов'
//		
//	* Создаем договор с Поставщик5
//
//		И в таблице "ПобедившиеПредложенияПоставщиков" я перехожу к строке:
//			| 'Поставщик'  |
//			| 'Поставщик5' |
//		И в таблице "ПобедившиеПредложенияПоставщиков" я активизирую поле с именем "ПобедившиеПредложенияПоставщиковПоставщик"
//		И в таблице "ПобедившиеПредложенияПоставщиков" я нажимаю на кнопку с именем 'СоздатьДоговорПоВыбранномуПредложениюПоставщика'
//		Тогда открылось окно 'С поставщиком (создание)'
//	
//		И пауза 1
//		
//		И в поле с именем 'Номер' я ввожу текст 'ДД3-2'
//		И я перехожу к следующему реквизиту
//		И я нажимаю кнопку выбора у поля с именем "Дата"
//		И в поле с именем 'Дата' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		И я перехожу к закладке с именем "ГруппаРасчеты"
//		И я перехожу к закладке с именем "СтраницаАналитикиПланирования"
//		И я перехожу к закладке с именем "СтраницаПланЗакупок"
//		И я перехожу к закладке с именем "ГруппаГрафик"
//		И в таблице "ГрафикРасчетов" я нажимаю на кнопку с именем 'ГрафикРассчитатьПоГрафикуПоставок'
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'ДД3-2 от * (С поставщиком) вер. * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'ДД3-2 от * (С поставщиком) вер. * от *' в течение 20 секунд	
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения
//	
Сценарий: 04.10. [ЗАПРОС КОТИРОВОК] ПТУ по договору ДД1
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		
//	* Открываем список поступлений
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Поступление (акты, накладные, УПД)'
//		Тогда открылось окно 'Поступление (акты, накладные, УПД)'
//		
//	* Создаем ПТУ	
//	
//		И я нажимаю на кнопку с именем 'СоздатьПоступлениеТовары'
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание)'
//		
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Контрагент
//	
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик2'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Договор 
//	
//		И я нажимаю кнопку выбора у поля с именем "ДоговорКонтрагента"
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер договора' |
//			| 'ДД1'            |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Склад
//
//		И я нажимаю кнопку выбора у поля с именем "Склад"
//		Тогда открылось окно 'Склады'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Склад1'       |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Заполняем	табличную часть
//	
//		И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыУХ_ЗаполнитьПоДоговору'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//			
//	* Цена		
//		
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '600,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//	* Проверяем правильность заполнения строки
//	
//		Тогда таблица "Товары" стала равной:
//			| 'Счет НДС' | '% НДС' | 'Количество' | 'Всего'      | 'Единица' | 'Счет учета' | 'Цена'   | 'Сумма'      | 'НДС'       | 'Страна происхождения' | 'Номенклатура' |
//			| '19.03'    | '20%'   | '950,000'    | '570 000,00' | 'т'       | '10.01'      | '600,00' | '570 000,00' | '95 000,00' | ''                     | 'Материал1'    |
//
//	* Проводим документ 
//	
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Поступление товаров: Накладная, УПД (создание) *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения	
//		
Сценарий: 04.11. [ЗАПРОС ПРЕДЛОЖЕНИЙ] ПТУ по договору ДД2
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		
//	* Открываем список поступлений
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Поступление (акты, накладные, УПД)'
//		Тогда открылось окно 'Поступление (акты, накладные, УПД)'
//		
//	* Создаем ПТУ	
//	
//		И я нажимаю на кнопку с именем 'СоздатьПоступлениеТовары'
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание)'
//		
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Контрагент
//	
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик4'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Договор 
//	
//		И я нажимаю кнопку выбора у поля с именем "ДоговорКонтрагента"
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер договора' |
//			| 'ДД2'            |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Склад
//
//		И я нажимаю кнопку выбора у поля с именем "Склад"
//		Тогда открылось окно 'Склады'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Склад1'       |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Заполняем	табличную часть
//	
//		И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыУХ_ЗаполнитьПоДоговору'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//			
//	* Цена		
//		
//		И в таблице "Товары" я перехожу к строке:
//			| 'Номенклатура' |
//			| 'Материал2'   |
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '1200,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//		И в таблице "Товары" я перехожу к строке:
//			| 'Номенклатура' |
//			| 'Материал3'   |
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '1100,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//	* Проверяем правильность заполнения строки
//	
//		# И в таблице "Товары" я активизирую поле с именем "ТоварыНоменклатура"
//		# И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыСортироватьСписокПоВозрастанию'
//		# Тогда таблица "Товары" стала равной:
//			# | 'Номенклатура' | 'Счет НДС' | '% НДС' | 'Количество' | 'Всего'      | 'Единица' | 'Счет учета' | 'Цена'     | 'Сумма'      | 'НДС'       | 'Страна происхождения' |
//			# | 'Материал2'    | '19.03'    | '20%'   | '200,000'    | '240 000,00' | 'т'       | '10.01'      | '1 200,00' | '240 000,00' | '40 000,00' | ''                     |
//			# | 'Материал3'    | '19.03'    | '20%'   | '100,000'    | '110 000,00' | 'т'       | '10.01'      | '1 100,00' | '110 000,00' | '18 333,33' | ''                     |
//
//	* Проводим документ 
//	
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Поступление товаров: Накладная, УПД (создание) *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения			
//		
Сценарий: 04.12. [КОНКУРС] ПТУ по договору ДД3-1 (поставщик: Поставщик4)
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		
//	* Открываем список поступлений
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Поступление (акты, накладные, УПД)'
//		Тогда открылось окно 'Поступление (акты, накладные, УПД)'
//		
//	* Создаем ПТУ	
//	
//		И я нажимаю на кнопку с именем 'СоздатьПоступлениеТовары'
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание)'
//		
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Контрагент
//	
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик4'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Договор 
//	
//		И я нажимаю кнопку выбора у поля с именем "ДоговорКонтрагента"
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер договора' |
//			| 'ДД3-1'          |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Склад
//
//		И я нажимаю кнопку выбора у поля с именем "Склад"
//		Тогда открылось окно 'Склады'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Склад1'       |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Заполняем	табличную часть
//	
//		И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыУХ_ЗаполнитьПоДоговору'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//			
//	* Цена		
//		
//		И в таблице "Товары" я перехожу к строке:
//			| 'Номенклатура' |
//			| 'Товар1'       |
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '1 250,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//		И в таблице "Товары" я перехожу к строке:
//			| 'Номенклатура' |
//			| 'Товар2'       |
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '8 500,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//	* Проверяем правильность заполнения строки
//		
//		# И в таблице "Товары" я активизирую поле с именем "ТоварыНоменклатура"
//		# И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыСортироватьСписокПоВозрастанию'
//		# Тогда таблица "Товары" стала равной:
//			# | 'Номенклатура' | 'Количество' | 'Всего'        | 'Единица' | 
//			# | 'Товар1'       | '277,000'    | '346 250,00'   | 'кг'      | 
//			# | 'Товар2'       | '389,000'    | '3 306 500,00' | 'упак'    | 
//
//	* Проводим документ 
//	
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Поступление товаров: Накладная, УПД (создание) *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения					
//		
Сценарий: 04.13. [КОНКУРС] ПТУ по договору ДД3-2 (поставщик: Поставщик5)
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		
//	* Открываем список поступлений
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Поступление (акты, накладные, УПД)'
//		Тогда открылось окно 'Поступление (акты, накладные, УПД)'
//		
//	* Создаем ПТУ	
//	
//		И я нажимаю на кнопку с именем 'СоздатьПоступлениеТовары'
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание)'
//		
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Контрагент
//	
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик5'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Договор 
//	
//		И я нажимаю кнопку выбора у поля с именем "ДоговорКонтрагента"
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер договора' |
//			| 'ДД3-2'            |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Склад
//
//		И я нажимаю кнопку выбора у поля с именем "Склад"
//		Тогда открылось окно 'Склады'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Склад1'       |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Заполняем	табличную часть
//	
//		И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыУХ_ЗаполнитьПоДоговору'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//			
//	* Цена		
//		
//		И в таблице "Товары" я перехожу к строке:
//			| 'Номенклатура' |
//			| 'Товар1'       |
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '1 200,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//		И в таблице "Товары" я перехожу к строке:
//			| 'Номенклатура' |
//			| 'Товар2'       |
//		И в таблице "Товары" я выбираю текущую строку
//		И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '8 500,00'
//		И в таблице "Товары" я завершаю редактирование строки
//		
//	* Проверяем правильность заполнения строки
//	
//		# И в таблице "Товары" я активизирую поле с именем "ТоварыНоменклатура"
//		# И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыСортироватьСписокПоВозрастанию'	
//		# Тогда таблица "Товары" стала равной:
//			# | 'Номенклатура' | 'Количество' | 'Всего'        | 'Единица' |
//			# | 'Товар1'       | '278,000'    | '333 600,00'   | 'кг'      |
//			# | 'Товар2'       | '388,000'    | '3 298 000,00' | 'упак'    |
//
//	* Проводим документ 
//	
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Поступление товаров: Накладная, УПД (создание) *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения							
//		
Сценарий: 04.14. [Обеспечение потребностей] Королевство Севера
//
//	* Открываем список обеспечения
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Обеспечение потребностей'
//		Тогда открылось окно 'Обеспечение потребностей'
//
//	* Создаем документ
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Обеспечение потребностей (создание)'
//
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Обеспечение потребностей (создание) *'
//		
//	* ЦФО 
//	
//		И я нажимаю кнопку выбора у поля с именем "ЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Севера [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Обеспечение потребностей (создание) *'
//	
//	* Заполняем табчасть
//	
//		И в таблице "Потребности" я нажимаю на кнопку с именем 'ПотребностиКомандаЗаполнитьПоБюджетамЗакупок'
//
//	* Проводим документ
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Обеспечение потребностей (создание) *' в течение 20 секунд
//	
//	* Закрываем все окна клиентского приложения
//			
//		И я закрываю все окна клиентского приложения							
//	
Сценарий: 04.15. [ЗАЯВКА -> ЗАКАЗ; Королевство Скал] Заявка на обеспечение

	* Запоминаем текущую дату + 30 дней
		
		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата()+30*24*60*60)' в переменную "ТекущаяДата30"

	* Открываем список заявок на обеспечение
	
		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Заявка на обеспечение'
		Тогда открылось окно 'Заявка на обеспечение'
		
	* Создаем документ	
	
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Заявка на обеспечение (создание)'
		
	* Организация	
	
		И я нажимаю кнопку выбора у поля с именем "Организация"
		Тогда открылось окно 'Организационные единицы'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование в программе' |
			| 'Королевство Скал'         |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Заявка на обеспечение (создание) *'
		
	* ЦФО	
		
		И я нажимаю кнопку выбора у поля с именем "ЦФО"
		Тогда открылось окно 'Организационные единицы'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование в программе' |
			| 'Королевство Скал'         |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Заявка на обеспечение (создание) *'

	* Проект
	
		И я нажимаю кнопку выбора у поля с именем "Проект"
		Тогда открылось окно 'Проекты и этапы'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование' |
			| 'Проект3'      |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Заявка на обеспечение (создание) *'
		
	* Дата поставки	
		
		И я устанавливаю флаг с именем 'ЕдинаяДатаОперации'
		И в поле с именем 'ДатаОперации' я ввожу значение переменной "ТекущаяДата30"
		И я перехожу к следующему реквизиту
		
	* Место поставки	
		
		И я устанавливаю флаг с именем 'ЕдиноеМестоПоставки'
		И я нажимаю кнопку выбора у поля с именем "МестоПоставки"
		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование'   |
			| 'МестоПоставки3' |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Заявка на обеспечение (создание) *'
		
	* Закладка потребности
	
		И я перехожу к закладке с именем "Потребности"
		
	* Фиксируем тип Номенклатура	
	
		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаЗафиксироватьТипНоменклатуры'
		Тогда открылось окно 'Выбор типа номенклатуры'
		И в таблице "" я перехожу к строке:
			| 'Колонка1'           |
			| 'Товарные категории' |
		И в таблице "" я перехожу к строке:
			| 'Колонка1'     |
			| 'Номенклатура' |
		И в таблице "" я выбираю текущую строку
		Тогда открылось окно 'Заявка на обеспечение (создание) *'
		
	* Товар6 
	
		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаДобавить'
		И в таблице "ПланыДокумента" я нажимаю кнопку выбора у реквизита с именем "ПланыДокументаНоменклатура"
		Тогда открылось окно 'Номенклатура'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование'| '% НДС' | 'Единица'  |
			| 'Товар6'      | '20%'   | 'шт'       |
		И в таблице "Список" я выбираю текущую строку
		И я перехожу к следующему реквизиту
		И в таблице "ПланыДокумента" я активизирую поле с именем "ПланыДокументаКоличество"
		И в таблице "ПланыДокумента" в поле с именем 'ПланыДокументаКоличество' я ввожу текст '33,000'
		И в таблице "ПланыДокумента" я перехожу к следующей ячейке
		И в таблице "ПланыДокумента" я завершаю редактирование строки
		
 
	* Проводим и закрываем открытые формы 
	
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
		Тогда открылось окно 'Заявка на обеспечение *'
		И я нажимаю на кнопку с именем 'ФормаПровести'
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна 'Заявка на обеспечение * от *' в течение 20 секунд
		Тогда открылось окно 'Заявка на обеспечение'
		И Я закрываю окно 'Заявка на обеспечение'
		
Сценарий: 04.16. [ЗАЯВКА -> ЗАКАЗ; Королевство Скал] Договор ДД4
//
//	* Запоминаем ТекущаяДата, ТекущаяДата30, НачалоГода, КонецГода
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"	
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата()+30*24*60*60)' в переменную "ТекущаяДата30"
//		И Я запоминаю значение выражения 'СокрЛП(НачалоГода(ТекущаяДата()))' в переменную "НачалоГода"
//		И Я запоминаю значение выражения 'СокрЛП((КонецГода(ТекущаяДата()))' в переменную "КонецГода"
//
//	* Открываем список договоров
//	
//		И В командном интерфейсе я выбираю 'Управление обязательствами' 'Договоры'
//		Тогда открылось окно 'Договоры'
//		
//	* Создаем договора	
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Выберите вид договора'
//		И в таблице "ВидыДоговоров" я перехожу к строке:
//			| 'Вид договора'  |
//			| 'С поставщиком' |
//		И в таблице "ВидыДоговоров" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание)'
//		
//	* Номер 
//
//		И Пауза 1	
//		
//		И в поле с именем 'Номер' я ввожу текст 'ДД4'
//		И я перехожу к следующему реквизиту
//	
//	* Дата
//	
//		И в поле с именем 'Дата' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* Организация 
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Скал'         |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание) *'
//	
//	* Поставщик5
//		
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик4'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание) *'
//		
//	* Дата начала действия договора	
//		
//		И в поле с именем 'НачалоДействия' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* Ставка НДС
//	
//		И из выпадающего списка с именем "СтавкаНДС" я выбираю точное значение '20%'
//	
//	* Сумма договора
//	
//		И в поле с именем 'СуммаДоговора' я ввожу текст '1 000 000,00'
//		И я перехожу к следующему реквизиту
//		
//	* Условия
//	
//		И я перехожу к закладке с именем "ГруппаРасчеты"
//		И из выпадающего списка с именем "ПорядокРасчетов" я выбираю точное значение 'По заказам'
//		
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание) *'
//		
//		И я разворачиваю группу с именем "ГруппаРасчетыПрочее"
//		
//		И я нажимаю кнопку выбора у поля с именем "ТипЦен"
//		Тогда открылось окно 'Типы цен номенклатуры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'  |
//			| 'Цена поставки' |
//		И в таблице "Список" я выбираю текущую строку
//	
//	* Записываем
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'ДД4 от * (С поставщиком) вер. * от *' в течение 20 секунд
//		Тогда открылось окно 'Договоры'
//	
//	* Закрываем все окна 
//	
//		И я закрываю все окна клиентского приложения
//		
Сценарий: 04.17. [ЗАЯВКА -> ЗАКАЗ; Королевство Скал] Заказ поставщику
//
//	* Открываем список заказов
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Заказы поставщикам'
//		Тогда открылось окно 'Заказы поставщикам'
//		
//	* Создаем заказ 
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Заказ поставщику (создание)'
//		
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Скал'         |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заказ поставщику (создание) *'
//		
//	* Поставщик4	
//		
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик4'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заказ поставщику (создание) *'
//		
//	* Валюта	
//		
//		И из выпадающего списка с именем "Валюта" я выбираю точное значение 'RUB'
//		
//	* Договор ДД4
//		
//		И я нажимаю кнопку выбора у поля с именем "ДоговорКонтрагента"
//		Тогда открылось окно 'Договоры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер договора' | 'Валюта' | 'Организация'      | 'Сумма'        |
//			| 'ДД4'            | 'RUB'    | 'Королевство Скал' | '1 000 000,00' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заказ поставщику (создание) *'
//		
//	* Закладка Товары
//	
//		И я перехожу к закладке с именем "ТоварыПоПодбору"
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'НоменклатураПодбор'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//		Тогда открылось окно 'Форма выбора потребностей'
//
//		И я нажимаю на кнопку с именем 'ВыборПериодаЗакупок'
//		Тогда открылось окно 'Выберите период'
//		И в поле с именем 'DateEnd' я ввожу текст '31.12.2024'
//		И я перехожу к следующему реквизиту
//		И я нажимаю на кнопку с именем 'Select'
//
//		И в таблице 'СписокПотребностей' я выделяю все строки
//		И в таблице "СписокПотребностей" я нажимаю на кнопку с именем 'СписокПотребностейПеренестиПотребность'
//		И я нажимаю на кнопку с именем 'ФормаОтправитьИЗакрыть'
//		Тогда открылось окно 'Заказ поставщику * от * *'
//		
//	* Склад 
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамСклад"
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//		И в таблице "ПотребностиПоГодам" из выпадающего списка с именем "ПотребностиПоГодамСклад" я выбираю точное значение 'Склад5'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//		
//	* Добавляем товар вручную
//	
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Товар6'       |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заказ поставщику * от * *'
//		И я перехожу к следующему реквизиту
//		
//	* Проект3	
//	
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамПроект"
//		Тогда открылось окно 'Проекты и этапы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Проект3'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заказ поставщику * от * *'
//		И я перехожу к следующему реквизиту
//	
//	* Место поставки3
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки3' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заказ поставщику * от * *'
//		
//	* Количество	
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамКоличество"
//		И в таблице "ПотребностиПоГодам" в поле с именем 'ПотребностиПоГодамКоличество' я ввожу текст '33,000'
//		И я перехожу к следующему реквизиту
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//
//	* Записываем
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Заказ поставщику * от *'
//		
//	* Проводим 
//	
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//		Тогда открылось окно 'Заказ поставщику * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Заказ поставщику * от *' в течение 20 секунд
//	
//	* Закрываем все окна
//	
//		И я закрыл все окна клиентского приложения	
//		
Сценарий: 04.18. [ЗАЯВКА -> ЗАКАЗ; Королевство Скал] ПТУ
//
//	* Запоминаем переменные
//	
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"	
//			
//	* Открываем список заказов поставщику
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Заказы поставщикам'
//		Тогда открылось окно 'Заказы поставщикам'
//		
//	* Находим наш заказ
//	
//		И в таблице "Список" я перехожу к строке:
//			| 'Организация'      | 'Поставщик'  | 'Сумма документа' |
//			| 'Королевство Скал' | 'Поставщик4' | '6 730 680,00'    |
//	
//	* Вводим ПТУ на основании заказа поставщика
//	
//		И я нажимаю на кнопку 'Поступление (акт, накладная, УПД)'
//		
//	* Открылась ПТУ 
//
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание)'
//		
//	* Подразделение	пту
//	
//		И я нажимаю кнопку выбора у поля "Подразделение"
//		Тогда открылось окно 'Подразделения'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'           |
//			| 'Основное подразделение' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Поступление товаров: Накладная, УПД (создание) *'
//		
//	* Номер и дата пту
//	
//		И в поле 'Накладная, УПД №' я ввожу текст '1'
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаВходящегоДокумента' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//
//	* Условия оплаты
//
//		И я нажимаю на гиперссылку с именем "ПорядокУчетаРасчетов"
//		Тогда открылось окно 'Расчеты'
//		И я меняю значение переключателя с именем 'СпособЗачетаАвансов' на 'Автоматически'
//		И я нажимаю на кнопку с именем 'ОК'				
//	
//	* Проводим и закрываем	пту
//	
//		И я нажимаю на кнопку 'Провести и закрыть'
//		И я жду закрытия окна 'Поступление товаров: Накладная, УПД (создание) *' в течение 20 секунд
//		
//	* Закрываем все окна
//	
//		И я закрыл все окна клиентского приложения
//		
Сценарий: 04.19. [ЗАЯВКА -> ЗАКАЗ; Королевство Скал] Возврат поставщику
//
//	* Открываем список пту 
//
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Поступление (акты, накладные, УПД)'
//		Тогда открылось окно 'Поступление (акты, накладные, УПД)'
//
//	* Находим наш документ 
//
//		И в таблице "Список" я перехожу к строке:
//			| 'Контрагент' | 'Организация'      | 'Склад'  | 'Сумма'        |
//			| 'Поставщик4' | 'Королевство Скал' | 'Склад5' | '6 730 680,00' |
//	
//	* Вводим на основании возврат товаров поставщику
//
//		И я нажимаю на кнопку с именем 'ФормаДокументВозвратТоваровПоставщикуСоздатьНаОсновании'
//		Тогда открылось окно 'Возврат товаров поставщику (создание) (Покупка, комиссия)'
//	
//	* Проводим и закрываем
//	
//		И я нажимаю на кнопку 'Провести и закрыть'
//		И я жду закрытия окна 'Возврат товаров поставщику (создание) (Покупка, комиссия)' в течение 20 секунд
//
//	* Закрываем все окна
//	
//		И я закрыл все окна клиентского приложения
//
Сценарий: 04.20. [ЗАЯВКА -> СПЗ; Королевство Дорна] Заявка на обеспечение 
//
//	* Запоминаем ТекущаяДата30 (текущая дата + 30 дней)
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата()+30*24*60*60)' в переменную "ТекущаяДата30"
//		
//	* Открываем список заявок на обеспечение
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Заявка на обеспечение'
//		Тогда открылось окно 'Заявка на обеспечение'
//		
//	* Создаем документ	
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Заявка на обеспечение (создание)'
//		
//	* Организация	
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Дорна [223]'  |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* ЦФО	
//		
//		И я нажимаю кнопку выбора у поля с именем "ЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Дорна [223]'  |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//
//	* Проект
//	
//		И я нажимаю кнопку выбора у поля с именем "Проект"
//		Тогда открылось окно 'Проекты и этапы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Проект3'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Дата поставки	
//		
//		И я устанавливаю флаг с именем 'ЕдинаяДатаОперации'
//		И в поле с именем 'ДатаОперации' я ввожу значение переменной "ТекущаяДата30"
//		И я перехожу к следующему реквизиту
//		
//	* Место поставки	
//		
//		И я устанавливаю флаг с именем 'ЕдиноеМестоПоставки'
//		И я нажимаю кнопку выбора у поля с именем "МестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки3' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Закладка потребности
//	
//		И я перехожу к закладке с именем "Потребности"
//		
//	* Фиксируем тип Номенклатура	
//	
//		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаЗафиксироватьТипНоменклатуры'
//		Тогда открылось окно 'Выбор типа номенклатуры'
//		И в таблице "" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Товарные категории' |
//		И в таблице "" я перехожу к строке:
//			| 'Колонка1'     |
//			| 'Номенклатура' |
//		И в таблице "" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Топливо1 
//	
//		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаДобавить'
//		И в таблице "ПланыДокумента" я нажимаю кнопку выбора у реквизита с именем "ПланыДокументаНоменклатура"
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| '% НДС' | 'Единица' | 'Наименование' |
//			| '20%'   | 'л'      | 'Топливо1'       |
//		И в таблице "Список" я выбираю текущую строку
//		И я перехожу к следующему реквизиту
//	
//	* Характеристика	
//	
//		И в таблице "ПланыДокумента" я активизирую поле с именем "ПланыДокументаХарактеристика"
//		И в таблице "ПланыДокумента" я выбираю текущую строку
//		И в таблице "ПланыДокумента" я нажимаю кнопку выбора у реквизита с именем "ПланыДокументаХарактеристика"
//		Тогда открылось окно 'Характеристики номенклатуры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'АИ-95'        |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Количество	
//	
//		И в таблице "ПланыДокумента" я активизирую поле с именем "ПланыДокументаКоличество"
//		И в таблице "ПланыДокумента" в поле с именем 'ПланыДокументаКоличество' я ввожу текст '10,000'
//		И в таблице "ПланыДокумента" я завершаю редактирование строки
//
//	* Проверка перед записью
//
//		Если поле с именем "ДатаОперации" заполнено Тогда
//		Иначе
//			И в поле с именем 'ДатаОперации' я ввожу значение переменной "ТекущаяДата30"
//
//	* Проводим и закрываем открытые формы 
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Заявка на обеспечение * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Заявка на обеспечение * от *' в течение 20 секунд
//		Тогда открылось окно 'Заявка на обеспечение'
//		И Я закрываю окно 'Заявка на обеспечение'
//
Сценарий: 04.21. [ЗАЯВКА -> СПЗ; Королевство Дорна] СПЗ
//
//	* Запоминаем ТекущаяДата30, НачалоГода, КонецГода
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата()+30*24*60*60)' в переменную "ТекущаяДата30"
//		И Я запоминаю значение выражения 'СокрЛП(НачалоГода(ТекущаяДата()))' в переменную "НачалоГода"
//		И Я запоминаю значение выражения 'СокрЛП(КонецГода(ТекущаяДата()))' в переменную "КонецГода"
//		
//	* Открываем список СПЗ
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Строки планов закупок'
//		Тогда открылось окно 'Строки планов закупок'
//	
//	* Создаем СПЗ
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Строка плана закупок (создание)'
//		
//	* Период закупок
//	
//		И я нажимаю кнопку выбора у поля с именем "ПериодЗакупок"
//		Тогда открылось окно 'Периоды'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| '2024 г.'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание)'
//	
//	* Способ выбора	
//	
//		И я нажимаю кнопку выбора у поля с именем "СпособВыбораПоставщика"
//		И из выпадающего списка с именем "СпособВыбораПоставщика" я выбираю точное значение 'Запрос котировок'
//
//	* Заказчик	
//	
//		И я нажимаю кнопку выбора у поля с именем "ОрганизацияДляЗаключенияДоговора"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Дорна [223]'  |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* ОрганизаторЗакупки	
//	
//		И я нажимаю кнопку выбора у поля с именем "ОрганизаторЗакупки"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Семь королевств'          |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* Вариант оплаты	
//	
//		И я нажимаю кнопку выбора у поля с именем "ВариантОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Валюта закупок	
//		
//		И из выпадающего списка с именем "ВалютаДокумента" я выбираю точное значение 'RUB'
//		
//	* Предмет договора	
//		
//		И я нажимаю кнопку выбора у поля с именем "ПредметДоговора"
//		Тогда открылось окно 'Предмет договора'
//		И в поле с именем 'InputFld' я ввожу текст 'Приобретение материалов, тест 1'
//		И я нажимаю на кнопку с именем 'OK'
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//	
//	* Общие требования
//	
//		И я перехожу к следующему реквизиту
//		И я нажимаю кнопку выбора у поля с именем "ОбщиеТребования"
//		Тогда открылось окно 'Общие требования'
//		И в поле с именем 'InputFld' я ввожу текст 'Нет, тест 1'
//		И я нажимаю на кнопку с именем 'OK'
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Даты 
//	
//		И в поле с именем 'ДатаНачалаПодготовкиЗакупки' я ввожу значение переменной "НачалоГода"
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаОфициальногоОбъявленияЗакупки' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		И в поле с именем 'ДатаИсполненияДоговора' я ввожу значение переменной "КонецГода"
//		И я перехожу к следующему реквизиту
//		
//	* Закладка ЕИС
//	
//		И я перехожу к закладке с именем "ГруппаЕИС"
//		И в поле с именем 'ПорядокФормированияЦеныДоговора' я ввожу текст 'Цена включает НДС'
//	
//	* Закладка Потребности
//	
//		И я перехожу к закладке с именем "ГруппаПотребности"
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//
//	* Топливо 1
//
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "TypeTree" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Номенклатура'       |
//		И в таблице "TypeTree" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//	
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Топливо1'     |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Характеристика
//	
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамХарактеристика"
//		Тогда открылось окно 'Характеристики номенклатуры'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'АИ-95'        |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Потребитель
//		
//		И я перехожу к следующему реквизиту
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Дорна [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		
//	* Место поставки
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки3' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Строка плана закупок (создание) *'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//	
//	* 2024
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодам2024Количество"
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейИюльКоличество"
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейАвгустКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейАвгустКоличество' я ввожу текст '10,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//	
//	* Подбор потребности из заяки на обеспечение
//	
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамПодборПотребностей'
//		Тогда открылось окно 'Форма выбора потребностей'
//		И в таблице "СписокПотребностей" я активизирую поле с именем "СписокПотребностейОрганизация"
//		И в таблице 'СписокПотребностей' я выделяю все строки
//		И в таблице "СписокПотребностей" я нажимаю на кнопку с именем 'СписокПотребностейПеренестиПотребность'
//		И я нажимаю на кнопку с именем 'ФормаОтправитьИЗакрыть'
//	
//	* Пересчитаем сумму
//		
//		И я нажимаю на кнопку с именем 'ОбновитьИтогиВШапке'
//
//	* ЦФО Исполнитель
//
//		И я нажимаю кнопку выбора у поля с именем "ЦФОИсполнитель"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе'    |
//			| 'ЦФО1 КоролевствоДорна [223]' |
//		И в таблице "Список" я выбираю текущую строку
//		
//	* Запись документа
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Строка плана закупок * от *'
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//		
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//		
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Строка плана закупок * от *' в течение 20 секунд
//
Сценарий: 02.22. [ЗАЯВКА -> ЛОТ;  Королевство простора] Заявка на обеспечение
//
//	* Запоминаем текущую дату + 30 дней
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата()+30*24*60*60)' в переменную "ТекущаяДата30"
//
//	* Открываем список заявок на обеспечение
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Заявка на обеспечение'
//		Тогда открылось окно 'Заявка на обеспечение'
//		
//	* Создаем документ	
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Заявка на обеспечение (создание)'
//		
//	* Организация	
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Простора'     |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* ЦФО	
//		
//		И я нажимаю кнопку выбора у поля с именем "ЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Простора'     |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//
//	* Проект
//	
//		И я нажимаю кнопку выбора у поля с именем "Проект"
//		Тогда открылось окно 'Проекты и этапы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Проект2'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Дата поставки	
//		
//		И я устанавливаю флаг с именем 'ЕдинаяДатаОперации'
//		И в поле с именем 'ДатаОперации' я ввожу значение переменной "ТекущаяДата30"
//		И я перехожу к следующему реквизиту
//		
//	* Место поставки	
//		
//		И я устанавливаю флаг с именем 'ЕдиноеМестоПоставки'
//		И я нажимаю кнопку выбора у поля с именем "МестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки2' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Закладка потребности
//	
//		И я перехожу к закладке с именем "Потребности"
//		
//	* Фиксируем тип Номенклатура	
//	
//		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаЗафиксироватьТипНоменклатуры'
//		Тогда открылось окно 'Выбор типа номенклатуры'
//		И в таблице "" я перехожу к строке:
//			| 'Колонка1'           |
//			| 'Товарные категории' |
//		И в таблице "" я перехожу к строке:
//			| 'Колонка1'     |
//			| 'Номенклатура' |
//		И в таблице "" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Товар1 
//	
//		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаДобавить'
//		И в таблице "ПланыДокумента" я нажимаю кнопку выбора у реквизита с именем "ПланыДокументаНоменклатура"
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| '% НДС' | 'Единица' | 'Наименование' |
//			| '20%'   | 'кг'      | 'Товар1'       |
//		И в таблице "Список" я выбираю текущую строку
//		И я перехожу к следующему реквизиту
//		И в таблице "ПланыДокумента" я активизирую поле с именем "ПланыДокументаКоличество"
//		И в таблице "ПланыДокумента" в поле с именем 'ПланыДокументаКоличество' я ввожу текст '100,000'
//		И в таблице "ПланыДокумента" я перехожу к следующей ячейке
//		И в таблице "ПланыДокумента" я завершаю редактирование строки
//		
//	* Товар2
//
//		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаДобавить'
//		И в таблице "ПланыДокумента" я нажимаю кнопку выбора у реквизита с именем "ПланыДокументаНоменклатура"
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| '% НДС' | 'Единица' | 'Наименование' |
//			| '20%'   | 'упак'    | 'Товар2'       |
//		И в таблице "Список" я выбираю текущую строку
//		И я перехожу к следующему реквизиту
//		И в таблице "ПланыДокумента" я активизирую поле с именем "ПланыДокументаКоличество"
//		И в таблице "ПланыДокумента" в поле с именем 'ПланыДокументаКоличество' я ввожу текст '100,000'
//		И в таблице "ПланыДокумента" я перехожу к следующей ячейке
//		И в таблице "ПланыДокумента" я завершаю редактирование строки
// 
//	* Проводим и закрываем открытые формы 
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Заявка на обеспечение * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Заявка на обеспечение * от *' в течение 20 секунд
//		Тогда открылось окно 'Заявка на обеспечение'
//		И Я закрываю окно 'Заявка на обеспечение'
//		
Сценарий: 04.23. [ЗАЯВКА -> ЛОТ;  Королевство простора] Закупочная процедура 
//
//	* Запоминаем текущую дату
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"	
//
//	* Открываем список закупочных процедур
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Закупочные процедуры'
//		Тогда открылось окно 'Закупочные процедуры'
//	
//	* Создаем процедуру
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Период закупок
//	
//		И я нажимаю кнопку выбора у поля с именем "ПериодЗакупок"
//		Тогда открылось окно 'Периоды'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| '2024 г.'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//
//	* Способ выбора
//
//		И я нажимаю кнопку выбора у поля с именем "СпособВыбораПоставщика"
//		Тогда открылось окно 'Способы закупок'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'     |
//			| 'Запрос котировок' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//	
//	* Заказчик
//
//		И я нажимаю кнопку выбора у поля с именем "ОрганизацияДляЗаключенияДоговора"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Простора'     |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Организатор	
//		
//		И я нажимаю кнопку выбора у поля с именем "ОрганизаторЗакупки"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Семь королевств'          |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Валюта документа	
//		
//		И из выпадающего списка с именем "ВалютаДокумента" я выбираю точное значение 'RUB'
//		
//	* Дата подготовки
//		
//		И в поле с именем 'ДатаНачалаПодготовкиЗакупки' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//	
//	* Дата официального объявления
//
//		И в поле с именем 'ДатаОфициальногоОбъявленияЗакупки' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* 	Предмет договора
//		
//		И в поле с именем 'ПредметДоговора' я ввожу текст 'Предмет договора (тест 4)'
//		И я перехожу к следующему реквизиту
//	
//	* Общие требования
//
//		И в поле с именем 'ОбщиеТребования' я ввожу текст 'Общие требования'
//		
//	* Приказ о назначении закупочной комиссии
//	
//		И я нажимаю кнопку выбора у поля с именем "ПриказОНазначенииЗакупочнойКомиссии"
//		Тогда открылось окно 'Приказы закупочной комиссии'
//		И в таблице "Список" я перехожу к строке:
//			| 'Номер приказа' |
//			| '000000001'     |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Условия 
//
//		И я перехожу к закладке с именем "ГруппаУсловияЗакупки"
//		И в поле с именем 'ПояснениеУсловияПоставки' я ввожу текст 'Пояснение условий договора'
//		И я перехожу к следующему реквизиту
//		
//	* Описание графика исполнения договора 
//			
//		И в поле с именем 'ОписаниеГрафикаПоставки' я ввожу текст 'Описание графика исполнения договора'
//		И я перехожу к следующему реквизиту
//		
//	* УсловияПоставкиИнкотермс
//	
//		И из выпадающего списка с именем "УсловияПоставкиИнкотермс" я выбираю точное значение 'FAS'
//		
//	* Условие оплаты
//	
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                      |
//			| 'Аванс 60% за 5 к.д., Постоплата 40% через 40 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Источник финансирования	
//		
//		И я нажимаю кнопку выбора у поля с именем "ИсточникФинансирования"
//		Тогда открылось окно 'Источники финансирования'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'               |
//			| 'Собственное финансирование' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Закупочная процедура №*'
//		
//	* Закладка Требования к поставщикам
//	
//		И я перехожу к закладке с именем "ГруппаТребованияКПоставщикам"
//		И в таблице "ТребованияКПоставщикам" я нажимаю на кнопку с именем 'ТребованияКПоставщикамЗаполнитьТребованияКПоставщикам'
//		
//	* Закладка	Требования к составу документов
//		
//		И я перехожу к закладке с именем "ГруппаТребованияКСоставуДокументов"
//		И в поле с именем 'ТребованияКОформлениюДокументации' я ввожу текст 'Требования к оформлению документации'
//		И я перехожу к следующему реквизиту
//		
//	* Закладка Условия выдачи документации
//	
//		И я перехожу к закладке с именем "ГруппаУсловияВыдачиДокументации"
//		И в поле с именем 'АдресПредоставленияДокументации' я ввожу текст 'Адрес предоставления документации'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'ПорядокПредоставления' я ввожу текст 'Порядок предоставления документации'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'СрокИПорядокОплатыЗаПредоставлениеДокументации' я ввожу текст 'Срок и порядок оплаты за предоставление документации'
//		
//	* Закладка Условия приема	
//		
//		И я перехожу к закладке с именем "ГруппаУсловияПриема"
//		
//		И в поле с именем 'EMailПриема' я ввожу текст 'net@mail.ru'
//		И в поле с именем 'АдресПриема' я ввожу текст 'Адрес приема документации'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'ГрафикРаботы' я ввожу текст 'График работы'
//		И я перехожу к следующему реквизиту
//	
//	* Закладка Условия рассмотрения заявок
//	
//		И я перехожу к закладке с именем "ГруппаУсловияРассмотренияЗаявок"
//		
//		И в поле с именем 'КоличествоМестСОбязанностьюЗаключитьДоговор' я ввожу текст '1'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'МинимальноеКоличествоЗаявок' я ввожу текст '2'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'ПорядокОценкиИСопоставленияЗаявок' я ввожу текст 'Порядок оценки и сопоставления заявок'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'АдресРассмотренияЗаявок' я ввожу текст 'Адрес рассмотрения заявок'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'АдресПодведенияИтогов' я ввожу текст 'Адрес подведения итогов'
//		И я перехожу к следующему реквизиту
//		
//	* Записываем документ	
//		
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		
//	* Расписание процедуры
//	
//		И я нажимаю на гиперссылку с именем "СвязанноеМероприятие"
//		Тогда открылось окно 'Стадии закупочной процедуры'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Стадии закупочной процедуры' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//
//	* Закладка Лоты
//	
//		И я перехожу к закладке с именем "ГруппаЛоты"
//		
//	* Создаем лот
//	
//		И в таблице "Лоты" я нажимаю на кнопку с именем 'ЛотыДобавить'
//		Тогда открылось окно 'Лоты (создание)'
//		
//	* Предмет договора	
//	
//		И в поле с именем 'ПредметДоговора' я ввожу текст 'Предмет договора'
//		
//	* Закладка Потребности	
//	
//		И я перехожу к закладке с именем "ГруппаНоменклатура"
//		
//	* Подбираем товары из заявки
//	
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПодборПотребностей'
//		Тогда открылось окно 'Форма выбора потребностей'
//
//		И я нажимаю на кнопку с именем 'ВыборПериодаЗакупок'
//		Тогда открылось окно 'Выберите период'
//		И в поле с именем 'DateEnd' я ввожу текст '31.12.2024'
//		И я перехожу к следующему реквизиту
//		И я нажимаю на кнопку с именем 'Select'
//
//		И в таблице "СписокПотребностей" я активизирую поле с именем "СписокПотребностейЦФО"
//		И в таблице 'СписокПотребностей' я выделяю все строки
//		И в таблице "СписокПотребностей" я нажимаю на кнопку с именем 'СписокПотребностейПеренестиПотребность'
//		И я нажимаю на кнопку с именем 'ФормаОтправитьИЗакрыть'
//		И пауза 1
//
//	* Добавим товар вручную 
//	
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамДобавить'
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//		И в таблице "ПотребностиПоГодам" я нажимаю кнопку выбора у реквизита с именем "ПотребностиПоГодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'|
//			| 'Товар1'      |
//		И в таблице "Список" я выбираю текущую строку
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамМестоПоставки"
//		И в таблице "ПотребностиПоГодам" из выпадающего списка с именем "ПотребностиПоГодамМестоПоставки" я выбираю точное значение 'МестоПоставки2'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//		
//		И в таблице "РасшифровкаПотребностей" я активизирую поле с именем "РасшифровкаПотребностейИюльКоличество"
//		И в таблице "РасшифровкаПотребностей" я выбираю текущую строку
//		И в таблице "РасшифровкаПотребностей" в поле с именем 'РасшифровкаПотребностейИюльКоличество' я ввожу текст '10,000'
//		И в таблице "РасшифровкаПотребностей" я завершаю редактирование строки
//		
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамПроект"
//		И в таблице "ПотребностиПоГодам" я выбираю текущую строку
//		И в таблице "ПотребностиПоГодам" из выпадающего списка с именем "ПотребностиПоГодамПроект" я выбираю точное значение 'Проект2'
//		И в таблице "ПотребностиПоГодам" я завершаю редактирование строки
//
//	* Проверяем подобранные товары 
//	
//		И в таблице "ПотребностиПоГодам" я активизирую поле с именем "ПотребностиПоГодамНоменклатура"
//		И в таблице "ПотребностиПоГодам" я нажимаю на кнопку с именем 'ПотребностиПоГодамСортироватьСписокПоВозрастанию'
//		Тогда таблица "ПотребностиПоГодам" стала равной:
//			| 'По плану потребности' | 'Номенклатура' | 'Цена плановая' |
//			| 'Да'                   | 'Товар1'       | '10 000,00'     |
//			| 'Нет'                  | 'Товар1'       | '10 000,00'     |
//			| 'Да'                   | 'Товар2'       | '8 500,00'      |
//	
//	* ЦФО Исполнитель
//
//		И я нажимаю кнопку выбора у поля с именем "ЦФОИсполнитель"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе'  |
//			| 'ЦФО1 Королевство простора' |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Записываем
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Лоты * от *'
//	
//	* Проводим
//	
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		
//	* Утверждаем лот
//	
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//
//	* Закрываем
//	
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Лоты * от *' в течение 20 секунд
//		Тогда открылось окно 'Закупочная процедура №*'
//	
//	* Утверждаем процедуру 
//	
//		И из выпадающего списка с именем "СтатусОбъекта" я выбираю точное значение 'Утвержден'
//
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//
//		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
//		И я жду закрытия окна 'Закупочная процедура №*' в течение 20 секунд
//		
//	* Закрываем все открытые окна
//	
//		И я закрыл все окна клиентского приложения
//		
Сценарий: 04.24. [ЗАЯВКА -> ДОГОВОР] Заявка на обеспечение Королевство Гор и Долин
//
//	* Запоминаем текущую дату + 30 дней
//		
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата()+30*24*60*60)' в переменную "ТекущаяДата30"
//
//	* Открываем список заявок на обеспечение
//	
//		И В командном интерфейсе я выбираю 'Корпоративные закупки' 'Заявка на обеспечение'
//		Тогда открылось окно 'Заявка на обеспечение'
//		
//	* Создаем документ	
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Заявка на обеспечение (создание)'
//		
//	* Организация	
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Гор и Долин'  |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* ЦФО	
//		
//		И я нажимаю кнопку выбора у поля с именем "ЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Гор и Долин'  |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//
//	* Проект
//	
//		И я нажимаю кнопку выбора у поля с именем "Проект"
//		Тогда открылось окно 'Проекты и этапы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование' |
//			| 'Проект3'      |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Дата поставки	
//		
//		И я устанавливаю флаг с именем 'ЕдинаяДатаОперации'
//		И в поле с именем 'ДатаОперации' я ввожу значение переменной "ТекущаяДата30"
//		И я перехожу к следующему реквизиту
//		
//	* Место поставки	
//		
//		И я устанавливаю флаг с именем 'ЕдиноеМестоПоставки'
//		И я нажимаю кнопку выбора у поля с именем "МестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки3' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//		
//	* Закладка потребности
//	
//		И я перехожу к закладке с именем "Потребности"
//		
//	* Фиксируем тип Номенклатура	
//	
////		И в таблице "ПланыДокумента" я нажимаю на кнопку с именем 'ПланыДокументаЗафиксироватьТипНоменклатуры'
////		Тогда открылось окно 'Выбор типа номенклатуры'
////		И в таблице "" я перехожу к строке:
////			| 'Колонка1'           |
////			| 'Товарные категории' |
////		И в таблице "" я перехожу к строке:
////			| 'Колонка1'     |
////			| 'Номенклатура' |
////		И в таблице "" я выбираю текущую строку
////		Тогда открылось окно 'Заявка на обеспечение (создание) *'
//
//	* Заполняем таблицу данными
//
//		И пауза 1		
//		И я заполняю таблицу "ПланыДокумента" данными
//			| 'Номенклатура' | 'Количество' |
//			| 'Товар4'       | '55,000'     |
//			| 'Товар5'       | '44,000'     |
// 
// 	* Проверка перед записью
//
//		Если поле с именем "ДатаОперации" заполнено Тогда
//		Иначе
//			И в поле с именем 'ДатаОперации' я ввожу значение переменной "ТекущаяДата30"
//			
//	* Проводим и закрываем открытые формы 
//	
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//		Тогда открылось окно 'Заявка на обеспечение * от *'
//		И я нажимаю на кнопку с именем 'ФормаПровести'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		И я жду закрытия окна 'Заявка на обеспечение * от *' в течение 20 секунд
//		Тогда открылось окно 'Заявка на обеспечение'
//		И Я закрываю окно 'Заявка на обеспечение'
//		
Сценарий: 04.25. [ЗАЯВКА -> ДОГОВОР] Договор ДД5 Королевство Гор и Долин
//
//	* Переменные ТекущаяДата, КонецСледующегоГода
//	
//		И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "ТекущаяДата"
//		И Я запоминаю значение выражения 'СокрЛП(КонецГода(ТекущаяДата()+365*24*60*60))' в переменную "КонецСледующегоГода"
//		
//	* Открываем список договоров
//
//		И В командном интерфейсе я выбираю 'Управление обязательствами' 'Договоры'
//		Тогда открылось окно 'Договоры'
//		
//	* Создаем договор
//	
//		И я нажимаю на кнопку с именем 'ФормаСоздать'
//		Тогда открылось окно 'Выберите вид договора'
//		И в таблице "ВидыДоговоров" я перехожу к строке:
//			| 'Вид договора'  |
//			| 'С поставщиком' |
//		И в таблице "ВидыДоговоров" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание)'
//		
//		И пауза 1
//	
//	* Номер и Дата
//	
//		И в поле с именем 'Номер' я ввожу текст 'ДД5'
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'Дата' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//	* Организация
//	
//		И я нажимаю кнопку выбора у поля с именем "Организация"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Королевство Гор и Долин'  |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание) *'
//		
//	* Поставщик6	
//		
//		И я нажимаю кнопку выбора у поля с именем "Контрагент"
//		Тогда открылось окно 'Контрагенты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщики'               |
//		И в таблице  "Список" я перехожу на один уровень вниз
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе' |
//			| 'Поставщик6'               |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание) *'
//	
//	* Срок действия договора
//		
//		И в поле с именем 'НачалоДействия' я ввожу значение переменной "ТекущаяДата"
//		И я перехожу к следующему реквизиту
//		
//		И в поле с именем 'СрокДействия' я ввожу значение переменной "КонецСледующегоГода"
//		И я перехожу к следующему реквизиту
//	
//	* Сумма, валюта, ставка ндс
//	
//		И из выпадающего списка с именем "ВалютаВзаиморасчетов" я выбираю точное значение 'RUB'
//		И в поле с именем 'СуммаДоговора' я ввожу текст '2 000 000,00'
//		И я перехожу к следующему реквизиту
//		И из выпадающего списка с именем "СтавкаНДС" я выбираю точное значение '20%'
//
//	* Условия оплаты
//		
//		И я перехожу к закладке с именем "ГруппаРасчеты"
//		И я нажимаю кнопку выбора у поля с именем "УсловиеОплаты"
//		Тогда открылось окно 'Условия оплаты'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'                                       |
//			| 'Аванс 50% за 30 к.д., Постоплата 50% через 30 к.д.' |
//		И в таблице "Список" я выбираю текущую строку
//		Тогда открылось окно 'С поставщиком (создание) *'
//		
//	* Использование графика 
//	
//		И я перехожу к закладке с именем "СтраницаАналитикиПланирования"
//		И я меняю значение переключателя с именем 'ГрафикДоговора' на 'Поставок и расчетов'
//	
//	* Подбирем потребность из заявок
//	
//		И я перехожу к закладке с именем "СтраницаПланЗакупок"
//		И в таблице "ПланПоставокПоПериодам" я нажимаю на кнопку с именем 'ПланПоставокПоПериодамПодборПотребностей'
//		Тогда открылось окно 'Форма выбора потребностей'
//		И в таблице 'СписокПотребностей' я выделяю все строки
//		И в таблице "СписокПотребностей" я нажимаю на кнопку с именем 'СписокПотребностейПеренестиПотребность'
//		И я нажимаю на кнопку с именем 'ФормаОтправитьИЗакрыть'
//		
//	* ЦФО Исполнитель
//
//		И я нажимаю кнопку выбора у поля с именем "ОсновнойЦФО"
//		Тогда открылось окно 'Организационные единицы'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование в программе'     |
//			| 'ЦФО1 Королевство Гор и Долин' |
//		И в таблице "Список" я выбираю текущую строку
//
//	* Записываем договор 
//
//		И я нажимаю на кнопку с именем 'ФормаЗаписать'
//
//	* Добавляем товар вручную 
//	
//		И в таблице "ПланПоставокПоПериодам" я нажимаю на кнопку с именем 'ПланПоставокПоПериодамДобавить'
//		
//		И в таблице "ПланПоставокПоПериодам" я активизирую поле с именем "ПланПоставокПоПериодамНоменклатура"
//		И в таблице "ПланПоставокПоПериодам" я нажимаю кнопку выбора у реквизита с именем "ПланПоставокПоПериодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| '% НДС' | 'Единица' | 'Наименование' |
//			| '20%'   | 'шт'      | 'Товар6'       |
//		И в таблице "Список" я выбираю текущую строку
//		И в таблице "ПланПоставокПоПериодам" я нажимаю кнопку выбора у реквизита с именем "ПланПоставокПоПериодамНоменклатура"
//		Тогда открылось окно 'Выбор типа данных'
//		И в таблице "" я выбираю текущую строку
//		Тогда открылось окно 'Номенклатура'
//		И в таблице "Список" я перехожу к строке:
//			| '% НДС' | 'Единица' | 'Наименование' |
//			| '20%'   | 'шт'      | 'Товар6'       |
//		И в таблице "Список" я выбираю текущую строку
//		
//		И в таблице "ПланПоставокПоПериодам" я активизирую поле с именем "ПланПоставокПоПериодамМестоПоставки"
//		И в таблице "ПланПоставокПоПериодам" я выбираю текущую строку
//		И в таблице "ПланПоставокПоПериодам" я нажимаю кнопку выбора у реквизита с именем "ПланПоставокПоПериодамМестоПоставки"
//		Тогда открылось окно 'Места поставки товаров (оказания услуг)'
//		И в таблице "Список" я перехожу к строке:
//			| 'Наименование'   |
//			| 'МестоПоставки3' |
//		И в таблице "Список" я выбираю текущую строку
//		И в таблице "ПланПоставокПоПериодам" я завершаю редактирование строки
//		И в таблице "ПланПоставокПоПериодам" я активизирую поле с именем "ПланПоставокПоПериодамМестоПоставки"
//		И в таблице "ПланПоставокПоПериодам" я перехожу к следующей ячейке
//		И в таблице "ПланПоставокПоПериодам" я перехожу к следующей ячейке
//		И в таблице "ПланПоставокПоПериодам" я перехожу к следующей ячейке
//		И в таблице "ПланПоставокПоПериодам" я перехожу к следующей ячейке
//		И в таблице "ПланПоставокПоПериодам" я перехожу к следующей ячейке
//		И в таблице "ПланПоставокПоПериодам" я перехожу к следующей ячейке
//		И в таблице "ПланПоставокПоПериодам" в текущее поле я ввожу текст "11"
//		И в таблице "ПланПоставокПоПериодам" я завершаю редактирование строки
//		
//	* Пересчитываем график расчетов и проводим
//		
//		И я перехожу к закладке с именем "ГруппаГрафик"
//		И в таблице "ГрафикРасчетов" я нажимаю на кнопку с именем 'ГрафикРассчитатьПоГрафикуПоставок'
//		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
//		Если открылось окно '1С:Предприятие' Тогда
//			И я нажимаю на кнопку с именем 'Button0'
//		Тогда открылось окно 'ДД5 от * (С поставщиком) вер. * от *'
//	
//	* Закрываем
//	
//		И Я закрываю окно 'ДД5 от * (С поставщиком) вер. * от *'
//		Тогда открылось окно 'Договоры'
//		И Я закрываю окно 'Договоры'