#language: ru

@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Экспортные сценарии для работы с подсистемой "Бюджетирование" - "Корректиновка значений показтелей"

Сценарий: Я создаю шаблон корректировки значений показателей с имененм "TheName" и видами отчетов

	* Открываем форму справочника
		И В командном интерфейсе я выбираю "Бюджетирование, отчетность и анализ" "Шаблоны корректировок значений показателей"

	* Удаляем элемент
		И Я в списке "Шаблоны корректировок значений показателей" по полю "Наименование" ищу элемент '[TheName]' "По точному совпадению" 
		И Пока в таблице 'Список' количество строк 'больше' 0 Тогда
			* Ставим пометку на удаление	
				И Я удаляю текущую строку в списке 'Список'
			* Переименовываем
				И Я запоминаю значение выражения 'СтрЗаменить(Новый УникальныйИдентификатор, "-", "")' в переменную 'УИД'
				И в таблице 'Список' я выбираю текущую строку
				Тогда открылось окно "* (Шаблоны корректировок значений показателей)"
				И в поле с именем 'Наименование' я ввожу значение переменной 'УИД'
				И я удаляю все строки таблицы 'ИспользуемыеВидыОтчетов'				
				И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
				И я жду закрытия окна "* (Шаблоны корректировок значений показателей) *" в течение 20 секунд

	* Создаем элемент
		Когда открылось окно "Шаблоны корректировок значений показателей"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Шаблоны корректировок значений показателей (создание)"		
		И я заполняю таблицу 'ИспользуемыеВидыОтчетов' данными
			|'Таблица'|
		И в поле с именем 'Наименование' я ввожу текст '[TheName]'
		Когда открылось окно "Шаблоны корректировок значений показателей (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Шаблоны корректировок значений показателей (создание) *" в течение 20 секунд
				
Сценарий: Для шаблона корректировки значений показателей с имененм "TheName" я заполняю таблицу корректировок значениями

	* Открываем форму справочника
		И В командном интерфейсе я выбираю "Бюджетирование, отчетность и анализ" "Шаблоны корректировок значений показателей"

	* Ищем элемент
		И Я в списке "Шаблоны корректировок значений показателей" по полю "Наименование" ищу и выбираю элемент '[TheName]' "По точному совпадению" 

	* Заполнение
		И я заполняю таблицу 'ТаблицаКорректировок' данными
			|'Таблица'|

	* Сохраняем элемент
		Когда открылось окно "[TheName] (Шаблоны корректировок значений показателей) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "[TheName] (Шаблоны корректировок значений показателей) *" в течение 20 секунд

Сценарий: Я создаю корректировку значений показателей сценарий "TheScenario" период "TheStartDate" периодичность "TheFrequency" организация "TheBusinessUnit" значения

	И В командном интерфейсе я выбираю "Бюджетирование, отчетность и анализ" "Корректировка значений показателей"
	Тогда открылось окно "Корректировка значений показателей"

	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Корректировка значений показателей (создание)"

	И я нажимаю кнопку выбора у поля с именем 'УправлениеПериодом'
	И Я в списке "Управление отчетным периодом" по полю "Сценарий" ищу элемент "[TheScenario]" "По точному совпадению"
	И Я в списке "Управление отчетным периодом" по полю "Периодичность" ищу элемент "[TheFrequency]" "По точному совпадению" 
	И Я в списке "Управление отчетным периодом" по полю "Период начала" ищу и выбираю элемент "[TheStartDate]" "По началу строки"

	Когда открылось окно "Корректировка значений показателей (создание) *"
	И я нажимаю кнопку выбора у поля с именем 'Организация'
	И Я выбираю организацию "[TheBusinessUnit]"

	И я заполняю таблицу 'ТаблицаКорректировок' данными
		|'Таблица'|
	
	Когда открылось окно "Корректировка значений показателей (создание) *"
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна "Корректировка значений показателей (создание) *" в течение 20 секунд

Сценарий: Я открываю новую корректировку значений показателей сценарий "TheScenario" период "TheStartDate" периодичность "TheFrequency" организация "TheBusinessUnit"

	И В командном интерфейсе я выбираю "Бюджетирование, отчетность и анализ" "Корректировка значений показателей"
	Тогда открылось окно "Корректировка значений показателей"

	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Корректировка значений показателей (создание)"

	И я нажимаю кнопку выбора у поля с именем 'УправлениеПериодом'
	И Я в списке "Управление отчетным периодом" по полю "Сценарий" ищу элемент "[TheScenario]" "По точному совпадению"
	И Я в списке "Управление отчетным периодом" по полю "Периодичность" ищу элемент "[TheFrequency]" "По точному совпадению" 
	И Я в списке "Управление отчетным периодом" по полю "Период начала" ищу и выбираю элемент "[TheStartDate]" "По началу строки"

	Когда открылось окно "Корректировка значений показателей (создание) *"
	И я нажимаю кнопку выбора у поля с именем 'Организация'
	И Я выбираю организацию "[TheBusinessUnit]"