#language: ru

@tree
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Экспортные сценарии для управлением НСИ - Статьи движения денежных средств

Как Тестировщик я хочу
иметь экспортные сценарии по статьям ДДС
чтобы было проще писать и поддерживать тесты

Контекст:
	   И Я запускаю сценарий открытия TestClient или подключаю уже существующий
	   И я закрываю все окна клиентского приложения

Сценарий: Я создаю группу статей ДДС с именем 'TheName'	

	* Открываем форму списка
		Если '$$ЭтоPerform$$' Тогда
			И я открываю основную форму списка справочника 'СтатьиДвиженияДенежныхСредств'
		Иначе
			И В командном интерфейсе я выбираю "Планирование и контроль" "Статьи движения денежных средств"

	* Удаляем элемент	
		И Я в списке "Статьи движения денежных средств" по полю "Наименование" ищу элемент '[TheName]' "По началу строки"		
		И Пока в таблице 'Список' количество строк 'больше' 0 Тогда
			И в таблице 'Список' я выбираю текущую строку
			И Я удаляю текущий элемент в окне "[TheName] (Статьи движения денежных средств)" очищая

	* Создаем элемент
		Тогда открылось окно "Статьи движения денежных средств"
		И я нажимаю на кнопку с именем 'ФормаСоздатьГруппу'
		Тогда открылось окно "Статьи движения денежных средств (создание группы)"
		И в поле с именем 'Наименование' я ввожу текст '[TheName]'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Статьи движения денежных средств (создание группы) *" в течение 20 секунд

	* Закрываем форму списка
		Когда открылось окно "Статьи движения денежных средств"
		И Я закрываю окно "Статьи движения денежных средств"

Сценарий: Я создаю статью ДДС с именем 'TheName' родителем 'TheParent'

	* Открываем форму списка
		Если '$$ЭтоPerform$$' Тогда
			И я открываю основную форму списка справочника 'СтатьиДвиженияДенежныхСредств'
		Иначе
			И В командном интерфейсе я выбираю "Планирование и контроль" "Статьи движения денежных средств"
	
	* Удаляем элемент
		И Я в списке "Статьи движения денежных средств" по полю "Наименование" ищу элемент '[TheName]' "По началу строки"		
		И Пока в таблице 'Список' количество строк 'больше' 0 Тогда
			И в таблице 'Список' я выбираю текущую строку
			И Я удаляю текущий элемент в окне "[TheName] (Статья движения денежных средств)" очищая
		
	* Создаем элемент
		Тогда открылось окно "Статьи движения денежных средств"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Статья движения денежных средств (создание)"
		И в поле с именем 'Наименование' я ввожу текст '[TheName]'
		И из выпадающего списка с именем 'Родитель' я выбираю по строке '[TheParent]'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Статья движения денежных средств (создание) *" в течение 20 секунд

	* Закрываем форму списка
		Когда открылось окно "Статьи движения денежных средств"
		И Я закрываю окно "Статьи движения денежных средств"	

Сценарий: Я для статьи ДДС с именем 'TheName' определяю группу раскрытия 'TheAnalyticsGroup'
	
	* Открываем форму списка
		Если '$$ЭтоPerform$$' Тогда
			И я открываю основную форму списка справочника 'СтатьиДвиженияДенежныхСредств'
		Иначе
			И В командном интерфейсе я выбираю "Планирование и контроль" "Статьи движения денежных средств"

	* Находим и заполняем элемент
		И Я в списке "Статьи движения денежных средств" по полю "Наименование" ищу элемент '[TheName]' "По началу строки"
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно '[TheName] (Статья движения денежных средств)'
		Если элемент формы с именем "ГруппаРаскрытия" стал равен '[TheAnalyticsGroup]' тогда
			И я жду закрытия окна '[TheName] (Статья движения денежных средств) *' в течение 20 секунд
		Иначе 
			И я меняю значение переключателя с именем 'ГруппаРаскрытияПереключатель' на ' '
			И из выпадающего списка с именем "ГруппаРаскрытия" я выбираю по строке '[TheAnalyticsGroup]'	
			
	* Закрываем форму элемента
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна '[TheName] (Статья движения денежных средств) *' в течение 20 секунд
		И Я закрываю окно "Статьи движения денежных средств"

Сценарий: Я для статьи ДДС с именем 'TheName' определяю виды аналитики 'TheAnalytics1', 'TheAnalytics2', 'TheAnalytics3', 'TheAnalytics4', 'TheAnalytics5', 'TheAnalytics6'
	
	* Открываем форму списка
		Если '$$ЭтоPerform$$' Тогда
			И я открываю основную форму списка справочника 'СтатьиДвиженияДенежныхСредств'
		Иначе
			И В командном интерфейсе я выбираю "Планирование и контроль" "Статьи движения денежных средств"

	* Находим и заполняем элемент
		И Я в списке "Статьи движения денежных средств" по полю "Наименование" ищу элемент '[TheName]' "По началу строки"
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно '[TheName] (Статья движения денежных средств)'

		Если элемент формы с именем "ГруппаРаскрытия" стал равен '' тогда
			И Я заполняю виды аналитики 'TheAnalytics1', 'TheAnalytics2', 'TheAnalytics3', 'TheAnalytics4', 'TheAnalytics5', 'TheAnalytics6'
			И я нажимаю на кнопку с именем 'ФормаЗаписать'
		Иначе 
			И я жду закрытия окна '[TheName] (Статья движения денежных средств) *' в течение 20 секунд
	
	* Закрываем форму элемента
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна '[TheName] (Статья движения денежных средств) *' в течение 20 секунд
		И Я закрываю окно "Статьи движения денежных средств"

Сценарий: Я для статьи ДДС с именем 'TheName' определяю тип движения статьи 'TheTypeDirection'

	* Открываем форму списка
		Если '$$ЭтоPerform$$' Тогда
			И я открываю основную форму списка справочника 'СтатьиДвиженияДенежныхСредств'
		Иначе
			И В командном интерфейсе я выбираю "Планирование и контроль" "Статьи движения денежных средств"

	* Находим и заполняем элемент
		И Я в списке "Статьи движения денежных средств" по полю "Наименование" ищу элемент '[TheName]' "По началу строки"
		И в таблице "Список" я выбираю текущую строку
		И я меняю значение переключателя с именем 'ПриходРасход' на '[TheTypeDirection]'
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
			
	* Закрываем форму элемента
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна '[TheName] (Статья движения денежных средств) *' в течение 20 секунд
		И Я закрываю окно "Статьи движения денежных средств"

Сценарий: Я для статьи ДДС с именем 'TheName' определяю хозяйственную операцию 'TheBusinessTransaction' в 1C:ERPУХ

	* Открываем форму списка
		Если '$$ЭтоPerform$$' Тогда
			И я открываю основную форму списка справочника 'СтатьиДвиженияДенежныхСредств'
		Иначе
			И В командном интерфейсе я выбираю "Планирование и контроль" "Статьи движения денежных средств"

	* Находим и заполняем элемент
		И Я в списке "Статьи движения денежных средств" по полю "Наименование" ищу элемент '[TheName]' "По началу строки"
		И в таблице "Список" я выбираю текущую строку
		Когда открылось окно '[TheName] (Статья движения денежных средств)'
		И я нажимаю на гиперссылку с именем "РедактироватьСписокХозяйственныхОпераций"
		Тогда открылось окно 'Список хозяйственных операций'
		И в таблице "СписокХозяйственныхОпераций" я нажимаю на кнопку с именем 'СписокХозяйственныхОперацийДобавить'
		Тогда открылось окно 'Хозяйственные операции'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование'             |
			| '[TheBusinessTransaction]' |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно 'Список хозяйственных операций *'
		И я нажимаю на кнопку с именем 'СохранитьСписок'
				
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
			
	* Закрываем форму элемента
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна '[TheName] (Статья движения денежных средств) *' в течение 20 секунд
		И Я закрываю окно "Статьи движения денежных средств"

