#language: ru

@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Экспортные сценарии общие

Сценарий: Инициализация переменных

	И Я запоминаю значение выражения 'ОбщегоНазначенияКлиентСерверУХ.ИмяКонфигурации() = "Perform"' в переменную '$$ЭтоPerform$$'

	И Я запоминаю значение выражения 'ОбщегоНазначенияКлиентСерверУХ.ИмяКонфигурации() = "УправлениеХолдингом" ИЛИ $$ЭтоPerform$$' в переменную '$$ЭтоУХ$$'
			
	И Я запоминаю значение выражения 'ОбщегоНазначенияКлиентСерверУХ.ИмяКонфигурации() = "УправлениеХолдингомERP"' в переменную '$$ЭтоЕРПУХ$$'

	Если в панели разделов есть команда 'Бюджетирование, отчетность и анализ' Тогда
		И Я запоминаю значение выражения 'Ru' в переменную '$$ЯзыкИнтерфейса$$'
	ИначеЕсли в панели разделов есть команда 'Budgeting, reporting, and analysis' Тогда
		И Я запоминаю значение выражения 'En' в переменную '$$ЯзыкИнтерфейса$$'
		
Сценарий: Таблица 'TheTable' содержит 'TheNumberOfLines' строк из списка:

	Тогда в таблице '[TheTable]' количество строк 'равно' '[TheNumberOfLines]'

	Тогда таблица '[TheTable]' содержит строки по шаблону:
		| 'Таблица' |	

Сценарий: Я для реквизита 'TheProperty' устанавливаю значение 'TheValue'

	Если 'ВРег("[TheValue]") = "ИСТИНА" ИЛИ ВРег("[TheValue]") = "TRUE"' Тогда
		И я устанавливаю флаг с именем '[TheProperty]'
	ИначеЕсли 'ВРег("[TheValue]") = "ЛОЖЬ" ИЛИ ВРег("[TheValue]") = "FALSE"' Тогда
		И я снимаю флаг с именем '[TheProperty]'
	Иначе
		И из выпадающего списка с именем '[TheProperty]' я выбираю точное значение "[TheValue]"

Сценарий: Я удаляю текущий элемент в окне 'TheWindowName' очищая 'TheFieldName1' 'TheFieldName2' 'TheFieldName3'

	Когда открылось окно "[TheWindowName]"	

	И я нажимаю на кнопку с именем 'ФормаУстановитьПометкуУдаления'
	Когда открылось окно "1С:Предприятие"
	Если элемент формы с именем 'Message' стал равен "Пометить * на удаление?" по шаблону Тогда
		И я нажимаю на кнопку с именем 'Button0'
	Иначе
		И я нажимаю на кнопку с именем 'Button1'

	И Я запоминаю значение выражения 'СтрЗаменить(Новый УникальныйИдентификатор, "-", "")' в переменную 'УИД'	
	Тогда в поле с именем 'Наименование' я ввожу значение переменной 'УИД'	
	Если поле с именем "Идентификатор" существует тогда
		И я нажимаю на кнопку с именем 'РазрешитьРедактированиеРеквизитовОбъекта'
		И я нажимаю на кнопку с именем 'РазрешитьРедактирование'	
		И в поле с именем 'Идентификатор' я ввожу значение переменной 'УИД'
	
	Если 'НЕ СтрНачинаетсяС("[TheFieldName1]", "[") И НЕ ПустаяСтрока("[TheFieldName1]")' Тогда
		Тогда в поле с именем '[TheFieldName1]' я ввожу текст ' '			
	Если 'НЕ СтрНачинаетсяС("[TheFieldName2]", "[") И НЕ ПустаяСтрока("[TheFieldName2]")' Тогда
		Тогда в поле с именем '[TheFieldName2]' я ввожу текст ' '
	Если 'НЕ СтрНачинаетсяС("[TheFieldName3]", "[") И НЕ ПустаяСтрока("[TheFieldName3]")' Тогда
		Тогда в поле с именем '[TheFieldName3]' я ввожу текст ' '

	Тогда открылось окно "[TheWindowName]*"		
	И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
	И я жду закрытия окна "[TheWindowName]*" в течение 20 секунд
			